{
  "sources": [
    {
      "title": "Microsoft Tech Community - Latest Blogs - Apps on Azure Blog",
      "feedUrl": "https://techcommunity.microsoft.com/plugins/custom/microsoft/o365/custom-blog-rss?tid=-2574164104208876465&board=AppsonAzureBlog&size=100",
      "siteUrl": "https://techcommunity.microsoft.com",
      "articles": [
        {
          "id": "https://techcommunity.microsoft.com/t5/apps-on-azure-blog/get-web-apps-certificates-in-bulk/ba-p/3436666",
          "author": "Marina_Liu",
          "description": "For Web App, there are two kinds of SSL/TLS certificates - private certificate and public certificate.\nFor some users they might have lots of web apps and certificates which need to managed. So I've been asked many times for how to get (both private and public) certificates in bulk. In this blog I will show how to get Web Apps private certificates and public certificates under a subscription correspondingly.\n \nGet Web Apps private certificates in bulk\nFor the private  certificates, we have the existing feature and API to bulk get the private certificates under a subscription. The following shows how to use Azure Resource Graph Explorer and Azure REST API to get them:\nOption 1: Use Azure Resource Graph Explorer\nIn Azure portal -> Go to the \"Resource Graph Explorer\" service -> search the \"mi…",
          "link": "https://techcommunity.microsoft.com/t5/apps-on-azure-blog/get-web-apps-certificates-in-bulk/ba-p/3436666",
          "publishedOn": "2022-06-09T11:59:12.000Z",
          "wordCount": 1002,
          "title": "Get Web Apps certificates in bulk",
          "imageUrl": "https://techcommunity.microsoft.com/t5/image/serverpage/image-id/375637i5D1672248FE695A6?v=v2"
        },
        {
          "id": "https://techcommunity.microsoft.com/t5/apps-on-azure-blog/efficient-oauth-authorisation-management-in-azure-api-management/ba-p/3469041",
          "author": "justinyoo",
          "description": "While developing an application, the majority of the time, you use API calls to send and receive messages. Therefore, you should follow an authentication and authorisation process to use the API unless it's the public API. Those authentication/authorisation process uses either 1) an auth key or 2) an access token through an OAuth process.\n \nUsing the auth key approach, you can store it in a safe place like the Azure Key Vault service and fetch the key. It's a relatively simple process. However, if you need to use the OAuth process, it gets complicated with the following authorisation process. Here's the conceptual OAuth process.\n \n\nRequest an authorisation code\nReceive the authorisation code\nRequest an access token by providing the authorisation code\nReceive the access token and a refresh …",
          "link": "https://techcommunity.microsoft.com/t5/apps-on-azure-blog/efficient-oauth-authorisation-management-in-azure-api-management/ba-p/3469041",
          "publishedOn": "2022-06-08T01:00:21.000Z",
          "wordCount": 2777,
          "title": "Efficient OAuth Authorisation Management in Azure API Management",
          "imageUrl": "https://techcommunity.microsoft.com/t5/image/serverpage/image-id/377678i66278DB94A1BE779/image-size/original?v=v2&px=-1"
        },
        {
          "id": "https://techcommunity.microsoft.com/t5/apps-on-azure-blog/implementing-a-token-store-with-apim-authorizations/ba-p/3453516",
          "author": "aaronpowell",
          "description": "In this post, we're going to look at the recently previewed Authorizations feature of Azure API Management (APIM) and see how to setup a React and TypeScript application that uses the Dropbox SDK to upload a file, without needing to handle OAuth token creation.\nWhat is APIM Authorizations\nBefore we dive into creating the application, let's quickly look at what this feature is.\n \nIn a connected system, being able to communicate between different Software as a Service (SaaS) platforms is a common task, but often these platforms will use OAuth2 to verify the user identity. This requires undertaking an authentication flow, which is fine if you're directly using the system, but what if it's being handled by a background job, like an Azure Function running with a Timer Trigger? Then we need to u…",
          "link": "https://techcommunity.microsoft.com/t5/apps-on-azure-blog/implementing-a-token-store-with-apim-authorizations/ba-p/3453516",
          "publishedOn": "2022-06-08T00:24:29.000Z",
          "wordCount": 2594,
          "title": "Implementing a Token Store with APIM Authorizations",
          "imageUrl": "https://techcommunity.microsoft.com/t5/image/serverpage/image-id/376636i7CB8C93B9E0A4B58?v=v2"
        },
        {
          "id": "https://techcommunity.microsoft.com/t5/apps-on-azure-blog/getting-started-with-azure-load-testing/ba-p/3437678",
          "author": "Nikita_Nallamothu",
          "description": "Getting started with Azure Load Testing\n \nGetting started with Azure Load Testing has never been easier. You can now create a test without prior knowledge of testing tools by entering a URL on the Azure portal. You can set up, run, and test a URL in less than 5 minutes.\n \nRun a quick test\n\nCreate an Azure Load Testing resource. You can use an existing resource if you have one.\nOnce it is created, navigate to the resource overview page.\nIn the Get started tab, click on Quick test.\nEnter the URL you want to test.\nOptionally, you can change any of the load parameters like number of virtual users, test duration, and ramp-up time.\nClick on Run test.\n\nScreenshot that shows the quick test interface in Azure portal\n \nCongrats! You have created and run a load test for your web application. You can modify the test parameters or extend the test by downloading and editing the JMeter script. Learn more about quick tests here. \n \nOnce you are done exploring Azure Load Testing, you will want to delete your resource to avoid ongoing billing.\n \nFor more details on Azure Load Testing, check out the preview documentation. Learn more about pricing details on our Azure Load Testing pricing page.\n \nWe’d love to hear from you through our feedback forum.",
          "link": "https://techcommunity.microsoft.com/t5/apps-on-azure-blog/getting-started-with-azure-load-testing/ba-p/3437678",
          "publishedOn": "2022-06-07T13:08:10.000Z",
          "wordCount": 790,
          "title": "Getting started with Azure Load Testing",
          "imageUrl": "https://techcommunity.microsoft.com/t5/image/serverpage/image-id/375739i390818BB453491C7?v=v2"
        },
        {
          "id": "https://techcommunity.microsoft.com/t5/apps-on-azure-blog/azure-load-testing-create-tests-faster-distribute-input-data-and/ba-p/3471215",
          "author": "Nagarjuna_V",
          "description": "We are months into our Azure Load Testing Preview. It’s a fully managed Azure service for developers and testers to generate high-scale load with custom Apache JMeter scripts and gain actionable insights to catch and fix performance bottlenecks at scale.\n \nBusinesses small and large, across industries like information technology, financial services, government services etc. have leveraged Azure Load Testing Preview to increase their confidence in being able to identify performance issues before they happen in production. Integrating load testing with CI/CD pipelines through GitHub Actions and Azure Pipelines enable identification of performance issues early in the app development process.\n \nWe’ve been engaging our customers to improve the service and cater to more load testing scenarios. B…",
          "link": "https://techcommunity.microsoft.com/t5/apps-on-azure-blog/azure-load-testing-create-tests-faster-distribute-input-data-and/ba-p/3471215",
          "publishedOn": "2022-06-07T12:36:22.000Z",
          "wordCount": 1066,
          "title": "Azure Load Testing: create tests faster, distribute input data, and much more",
          "imageUrl": "https://cdn.techcommunity.microsoft.com/assets/MTC_Open_graph_image1.jpg"
        },
        {
          "id": "https://techcommunity.microsoft.com/t5/apps-on-azure-blog/how-to-export-import-database-from-azure-flexible-server-to/ba-p/3454396",
          "author": "Tony_Ju",
          "description": "MySQL In App allow us import and export data to and from an external MySQL database directly.\n \n\n \nThere are two version of Azure MySQL server :  Azure MySQL single Server and Azure MySQL Flexible Server.\nThere is no issue when export from MySQL in APP to Azure MySQL single Server as the external server. \nBut if we try to export from MySQL in APP to Azure MySQL Flexible Server, we will encounter below error. \n \n\nThe error message is not useful for us to troubleshooting. Even when I go to the activity logs to check the detailed error message. I still cannot get the cause. \n\nError occurred while connecting to the database  on server tonyserver.mysql.database.azure.com: Unable to connect to any of the specified MySQL hosts.. Please make sure the database connection string is up to date.\n \nThe…",
          "link": "https://techcommunity.microsoft.com/t5/apps-on-azure-blog/how-to-export-import-database-from-azure-flexible-server-to/ba-p/3454396",
          "publishedOn": "2022-06-06T04:01:35.000Z",
          "wordCount": 990,
          "title": "How to export/import database from Azure Flexible server to MySQL In App?",
          "imageUrl": "https://techcommunity.microsoft.com/t5/image/serverpage/image-id/377742i68EAA7896A61AFCC?v=v2"
        },
        {
          "id": "https://techcommunity.microsoft.com/t5/apps-on-azure-blog/new-major-release-of-durable-functions-for-nodejs/ba-p/3451227",
          "author": "davidmrdavid",
          "description": "TLDR; we’ve just released a new major version of the Durable Functions NodeJS SDK. \n \nTo try out it out, install durable-functions v2.x from npm. \n \nNote: This is a breaking change release, so make sure to check that your applications are not affected by any of the modified APIs. That said, we have only changed edge-case behaviors that we believe should not affect most apps. \n \nDurable Functions (DF) makes it easy to implement robust stateful services that make full use of the scaling and billing benefits of serverless, all while using your language of choice: C#, JavaScript/TypeScript, Python, and PowerShell. \n \nAs DF makes its way into more languages, we’ve been working on ways to optimize each programming language’s SDK to be as performant as possible. We made changes that significantly…",
          "link": "https://techcommunity.microsoft.com/t5/apps-on-azure-blog/new-major-release-of-durable-functions-for-nodejs/ba-p/3451227",
          "publishedOn": "2022-06-03T20:31:40.000Z",
          "wordCount": 1245,
          "title": "New major release of Durable Functions for NodeJS",
          "imageUrl": "https://techcommunity.microsoft.com/t5/image/serverpage/image-id/376467i57425C29AF7A557A?v=v2"
        },
        {
          "id": "https://techcommunity.microsoft.com/t5/apps-on-azure-blog/getting-started-with-azure-kubernetes-service-and-loki/ba-p/3406880",
          "author": "Tommy Falgout",
          "description": "Searching through application logs is a critical part of any operations team. And as the Cloud Native ecosystem grows and evolves, more modern approaches for this use case are emerging.\n \nThe thing about retaining logs is that the storage requirements can get big. REALLY big.\n \nOne of the most common log search and indexing tools is ElasticSearch. ElasticSearch is exceptionally good at finding a needle in the haystack (e.g. When did the string \"Error message #123\" occur in any copy of application X on March 17th). It does this by indexing the contents of the log message which can significantly increase your storage consumption.\n \nThe enthusiastic team at Grafana created Loki to address this problem. Instead of indexing the full log message, Loki only indexes the metadata (e.g. label, names…",
          "link": "https://techcommunity.microsoft.com/t5/apps-on-azure-blog/getting-started-with-azure-kubernetes-service-and-loki/ba-p/3406880",
          "publishedOn": "2022-05-25T20:49:23.000Z",
          "wordCount": 1118,
          "title": "Getting started with Azure Kubernetes Service and Loki",
          "imageUrl": "https://techcommunity.microsoft.com/t5/image/serverpage/image-id/374749i3E584CB09424EB0D/image-size/original?v=v2&px=-1"
        },
        {
          "id": "https://techcommunity.microsoft.com/t5/apps-on-azure-blog/azure-spring-cloud-is-now-azure-spring-apps/ba-p/3425255",
          "author": "Sean_Li",
          "description": "Since 2019, we’ve expanded the capabilities of Azure Spring Cloud, including the Enterprise tier we announced in preview at SpringOne in 2021.  Azure Spring Cloud is a fully featured platform for all types of Spring applications, and to better reflect this we’re now calling the service Azure Spring Apps. \n \nWe’ve created new versions for Azure CLI, as well as new plugins for Maven, IntelliJ and VS Code. Existing versions will continue to operate in deprecation mode.  \nYou’ll see this change is already reflected in the Azure portal, Azure CLI, API, Azure marketplace, and VMware Tanzu product descriptions.  The name has already been updated in Microsoft Docs, but you will continue to see the old name in some places for a while as we work to update assets such as screenshots, videos, and diagrams. \nChanges in the Azure billing meter description, Powershell, Github actions, Azure DevOps task and Nubesgen will take place in upcoming weeks.  \nAs introducing the name change in Terraform unavoidably interrupts existing behavior, we’re still in the process of evaluating whether we’ll change the name in Terraform.  \n \nAction recommended \n\nUpgrade to the new version of Azure CLI with\naz extension add -n spring\nYou can optionally remove the old extension using \naz extension remove -n spring-cloud \n\nUpgrade plugins for Maven , IntelliJ and VS Code.",
          "link": "https://techcommunity.microsoft.com/t5/apps-on-azure-blog/azure-spring-cloud-is-now-azure-spring-apps/ba-p/3425255",
          "publishedOn": "2022-05-25T05:36:25.000Z",
          "wordCount": 793,
          "title": "Azure Spring Cloud is now Azure Spring Apps",
          "imageUrl": "https://cdn.techcommunity.microsoft.com/assets/MTC_Open_graph_image1.jpg"
        },
        {
          "id": "https://techcommunity.microsoft.com/t5/apps-on-azure-blog/dapr-ml-gitops-extensions-ga-on-aks/ba-p/3423296",
          "author": "kavithagowda",
          "description": "We are excited to announce the General Availability of three new capabilities being enabled on AKS – Dapr , Azure Machine Learning and GitOps. These capabilities can be enabled on AKS clusters through a feature called cluster extensions. \nCluster extensions provide an at-scale mechanism to deploy, update and manage the lifecycle of services represented by extension instances running on your AKS clusters. With this capability, management of these services can be done through tools like the Azure CLI and the Azure SDKs. Let's use the rest of the blog to walk you through what each of these new capabilities enable.  \n  \nWhat are AKS cluster extensions?  \nCluster extensions provide an Azure Resource Manager (ARM) driven experience for installation and lifecycle management of Azure services and …",
          "link": "https://techcommunity.microsoft.com/t5/apps-on-azure-blog/dapr-ml-gitops-extensions-ga-on-aks/ba-p/3423296",
          "publishedOn": "2022-05-24T19:29:02.000Z",
          "wordCount": 1722,
          "title": "Dapr, ML, Gitops Extensions GA on AKS",
          "imageUrl": "https://techcommunity.microsoft.com/t5/image/serverpage/image-id/374768iE5F2810C3A63D57B?v=v2"
        },
        {
          "id": "https://techcommunity.microsoft.com/t5/apps-on-azure-blog/introducing-the-redesigned-azure-extensions-for-vs-code/ba-p/3423042",
          "author": "fiveisprime",
          "description": "We launched the VS Code Azure extensions close to five years ago and today, we’re thrilled to announce the next step forward in how the extensions can help you be productive building and deploying web apps in VS Code. The team has been (very) hard at work re-architecting the extensions to be easier to navigate and use, which will lead into the next evolution of how you build apps later this year. This will cover the larger changes to give you an idea of how you can take advantage of them and be more productive with Azure in VS Code.\n \nInstall the Azure Tools extension pack in the VS Marketplace.\n \nWhat’s new\nFirst, the explorer has been updated so that all extensions integrate into a single, unified view. You’ll see all your existing resources in the updated Resources view – this is where …",
          "link": "https://techcommunity.microsoft.com/t5/apps-on-azure-blog/introducing-the-redesigned-azure-extensions-for-vs-code/ba-p/3423042",
          "publishedOn": "2022-05-24T18:55:12.000Z",
          "wordCount": 1008,
          "title": "Introducing the redesigned Azure extensions for VS Code",
          "imageUrl": "https://techcommunity.microsoft.com/t5/image/serverpage/image-id/374758i8E3A4065F822B794/image-size/original?v=v2&px=-1"
        },
        {
          "id": "https://techcommunity.microsoft.com/t5/apps-on-azure-blog/connecting-services-has-never-been-so-easy-with-service/ba-p/3408053",
          "author": "balansubr",
          "description": "Today, we are announcing the general availability of Service Connector on Azure. You can seamlessly connect your Azure App Service, Azure Container Apps and Azure Spring Apps to database, storage, real-time messaging services with single-click or single-command experience in Service Connector. You also get the connection health status for different aspects of each connection.\nService Connector abstracts away the complexity of service wiring and connection management, so you can focus on building your business logic and let Azure take care of the configurations between services.\nOver the past two years, we worked with many customers to learn how they run cloud native apps on Azure. Many of these apps use services such as App Service and talk to Azure database services, storage accounts, Azu…",
          "link": "https://techcommunity.microsoft.com/t5/apps-on-azure-blog/connecting-services-has-never-been-so-easy-with-service/ba-p/3408053",
          "publishedOn": "2022-05-24T15:50:00.000Z",
          "wordCount": 1111,
          "title": "Connecting services has never been so easy with Service Connector – now Generally Available",
          "imageUrl": "https://techcommunity.microsoft.com/t5/image/serverpage/image-id/374707i42C0F02FEB81CD0A/image-size/original?v=v2&px=-1"
        },
        {
          "id": "https://techcommunity.microsoft.com/t5/apps-on-azure-blog/azure-spring-apps-enterprise-tier-is-now-generally-available/ba-p/3418245",
          "author": "Asir_Selvasingh",
          "description": "by -- Julia Liuson, President, Developer Division\n \nAzure Spring Cloud is now Azure Spring Apps\n \nWe launched Azure Spring Cloud with VMware in 2019 to solve common challenges developers, IT operators, and DevOps teams face when running Spring Boot applications at scale. Since then we’ve helped many customers adopt the service including Bosch, Digital Realty, FedEx, Kroger, Liantis, Morgan Stanley, National Life, Raley’s, and Swiss Re. They value the fully managed infrastructure of Azure Spring Cloud that lets them focus on their apps, while the service manages dynamic scaling, security patching, out-of-the-box instrumentation for monitoring, and more. Through customer feedback. we have expanded the capabilities of the service, including the Enterprise tier that we announced in preview at …",
          "link": "https://techcommunity.microsoft.com/t5/apps-on-azure-blog/azure-spring-apps-enterprise-tier-is-now-generally-available/ba-p/3418245",
          "publishedOn": "2022-05-24T15:00:02.000Z",
          "wordCount": 2927,
          "title": "Azure Spring Apps Enterprise tier is now generally available!",
          "imageUrl": "https://techcommunity.microsoft.com/t5/image/serverpage/image-id/374477i3BAC25BE6CBB1E40/image-size/original?v=v2&px=-1"
        },
        {
          "id": "https://techcommunity.microsoft.com/t5/apps-on-azure-blog/azure-container-apps-general-availability/ba-p/3416885",
          "author": "DariaGrigoriu",
          "description": "Next generation apps are cloud-native. Cloud-native apps are often composed of distributed microservices hosted in containers for solutions that are loosely coupled, resilient, manageable, and observable as defined by the Cloud Native Computing Foundation. Azure Container Apps delivers seamless support for cloud-native apps with serverless containers purpose-built for microservices, enabling app modernization in a Kubernetes-based environment. At Microsoft Build, we announced the general availability of Azure Container Apps, and we are looking forward to hosting your production apps!\n \nAzure Container Apps is an app-centric service, empowering developers to focus on the differentiating business logic of their apps rather than on cloud infrastructure management. Azure Container Apps execute…",
          "link": "https://techcommunity.microsoft.com/t5/apps-on-azure-blog/azure-container-apps-general-availability/ba-p/3416885",
          "publishedOn": "2022-05-24T15:00:02.000Z",
          "wordCount": 1304,
          "title": "Azure Container Apps General Availability",
          "imageUrl": "https://techcommunity.microsoft.com/t5/image/serverpage/image-id/374320i9FDC04FA3FA2E3B3/image-size/original?v=v2&px=-1"
        },
        {
          "id": "https://techcommunity.microsoft.com/t5/apps-on-azure-blog/azure-kubernetes-service-aks-updates-for-seamless-developer-and/ba-p/3407089",
          "author": "sabbour",
          "description": "Last week at KubeCon + CloudNativeCon Europe 2022, we announced the general availability of the Open Service Mesh (OSM) extension for Arc-enabled clusters, Kubernetes secrets encryption with keys stored in Azure Key Vault, and more.\nAt Microsoft Build, we are announcing several enhancements to the developer and operator experiences for Azure Kubernetes Service (AKS).\nKubernetes for all developers\nWhen developers approach building applications that run on top of Kubernetes, they need to learn many infrastructure concepts, like containerization, Kubernetes manifests, and ingresses, which significantly increases their cognitive overload. As we’re building Azure Kubernetes Service (AKS), we want it to be a destination for all developers with the best getting started experience on Kubernetes, w…",
          "link": "https://techcommunity.microsoft.com/t5/apps-on-azure-blog/azure-kubernetes-service-aks-updates-for-seamless-developer-and/ba-p/3407089",
          "publishedOn": "2022-05-24T15:00:00.000Z",
          "wordCount": 2466,
          "title": "Azure Kubernetes Service (AKS) – Updates for seamless developer and operator experiences, anywhere",
          "imageUrl": "https://techcommunity.microsoft.com/t5/image/serverpage/image-id/373878i14FE82419DC8B589/image-size/original?v=v2&px=-1"
        },
        {
          "id": "https://techcommunity.microsoft.com/t5/apps-on-azure-blog/what-s-new-in-azure-app-service-at-build-2022/ba-p/3407584",
          "author": "Stefan Schackow",
          "description": "New at Build 2022\nThe Azure App Service team has been busy cooking up a smörgåsbord of features in time for Build 2022.  Ever since App Service supported HTTP/2, developers have been looking forward to gRPC support and we are delighted to introduce the upcoming preview of gRPC on App Service at Build 2022.  Azure App Service is also announcing a preview of the full end-to-end migration experience in Azure Migrate that enables Windows .NET developers to seamlessly migrate their ASP.NET applications into Azure App Service.  Just prior to Build 2022, Azure App Service enabled virtual network integration and private endpoints for Windows and Linux customers running on the Basic pricing tier.  Additionally, we recently published a new Landing Zone Accelerator with architecture guidance and Infr…",
          "link": "https://techcommunity.microsoft.com/t5/apps-on-azure-blog/what-s-new-in-azure-app-service-at-build-2022/ba-p/3407584",
          "publishedOn": "2022-05-24T15:00:00.000Z",
          "wordCount": 2448,
          "title": "What's New in Azure App Service at Build 2022",
          "imageUrl": "https://techcommunity.microsoft.com/t5/image/serverpage/image-id/373807i473ED57E94D29A89?v=v2"
        },
        {
          "id": "https://techcommunity.microsoft.com/t5/apps-on-azure-blog/how-to-use-a-tls-ssl-certificate-in-your-python-code-in-azure/ba-p/3409568",
          "author": "KevinLi",
          "description": "If you want to know how to use it in C#/Java, there are some sample code in this document: https://docs.microsoft.com/en-us/azure/app-service/configure-ssl-certificate-in-code. Basically, to refer certificates uploaded in Azure App Service Linux using Python does not make much difference from in a local machine. It can be divided into three steps:\n \nSteps:\n1. Upload or import the certificates in Azure Portal to make it accessible to the app service:\nhttps://docs.microsoft.com/en-us/azure/app-service/configure-ssl-certificate?tabs=apex%2Cportal#upload-a-public-certificate\n\n \n\n2. Load certificate by setting WEBSITE_LOAD_CERTIFICATES to * or a specific thumbprint which belong to the certificate you want to use.\nThen the certificate(s) will be injected into the python container in the path \"/v…",
          "link": "https://techcommunity.microsoft.com/t5/apps-on-azure-blog/how-to-use-a-tls-ssl-certificate-in-your-python-code-in-azure/ba-p/3409568",
          "publishedOn": "2022-05-22T21:10:56.000Z",
          "wordCount": 866,
          "title": "How to use a TLS/SSL certificate in your Python code in Azure App Service",
          "imageUrl": "https://techcommunity.microsoft.com/t5/image/serverpage/image-id/373892iFE9990BBD9B803B3?v=v2"
        },
        {
          "id": "https://techcommunity.microsoft.com/t5/apps-on-azure-blog/a-coding-pitfall-in-implementing-dependency-injection-in-net/ba-p/3411110",
          "author": "acorn20180214",
          "description": ".NET Azure Functions supports the dependency injection (DI) software design pattern to achieve Inversion of Control (IoC) between classes and their dependencies.  The official article explains how to implement dependency injection in Azure .NET Functions.\n \n2 key points are summarized as below:\n1.  Create a custom Startup.cs that inherits from FunctionsStartup class from the Microsoft.Azure.Functions.Extensions NuGet package.  This startup class is meant for setup and dependency registration only but not for using any of the registered services during startup process.   The startup class runs once and only once to build up the ServiceCollection when the function host starts up.\n2.  Service lifetimes:\n\nTransient: Transient services are created upon each resolution of the service.\nScoped: Th…",
          "link": "https://techcommunity.microsoft.com/t5/apps-on-azure-blog/a-coding-pitfall-in-implementing-dependency-injection-in-net/ba-p/3411110",
          "publishedOn": "2022-05-22T21:08:35.000Z",
          "wordCount": 2075,
          "title": "A coding pitfall in implementing dependency injection in .NET azure functions",
          "imageUrl": "https://techcommunity.microsoft.com/t5/image/serverpage/image-id/374015i2408F89CFEF0BA98/image-size/original?v=v2&px=-1"
        },
        {
          "id": "https://techcommunity.microsoft.com/t5/apps-on-azure-blog/an-azure-developer-s-guide-to-microsoft-build-2022/ba-p/3396664",
          "author": "Jenn Jinhong",
          "description": "Microsoft Build 2022 takes place May 24-26, 2022.\n \nDiscover the latest news in Azure application development and learn how to take advantage of the latest innovation to build secure, future-ready applications productively.\n \nOn Day 1, in the Microsoft Build Opening keynote, Satya Nadella will share how Microsoft is creating new opportunities for developers across our platforms.\n \nOn Day 2, Microsoft CTO Kevin Scott, will share how new advances in AI and other tech and software innovations are empowering developers and creators to do more, be more productive and creative, and enrich the lives of everyone on the planet in the The Future of AI Development Tools.\n  \nAfter each day, join Scott Hanselman and friends as they discuss Build content, share their perspectives, interviews and recap t…",
          "link": "https://techcommunity.microsoft.com/t5/apps-on-azure-blog/an-azure-developer-s-guide-to-microsoft-build-2022/ba-p/3396664",
          "publishedOn": "2022-05-18T23:42:56.000Z",
          "wordCount": 1491,
          "title": "An Azure Developer's guide to Microsoft Build 2022",
          "imageUrl": "https://techcommunity.microsoft.com/t5/image/serverpage/image-id/373024iAD94313487D2D14E/image-size/original?v=v2&px=-1"
        },
        {
          "id": "https://techcommunity.microsoft.com/t5/apps-on-azure-blog/multi-stage-azure-static-web-apps-deployments-with-azure-devops/ba-p/3390625",
          "author": "Anthony Chu",
          "description": "This article is part of the #30DaysOfSWA blog series. Check out https://aka.ms/30DaysOfSWA for many more amazing articles about Azure Static Web Apps!\n \nAzure Static Web Apps recently introduced the ability to automatically configure an Azure DevOps pipeline to build and deploy your app. It's a great way to get your app up and running quickly.\n \nFor production applications, it's common to first deploy an app to staging environment(s) prior to deploying to production. In this article, we'll walk through how to configure a robust Azure DevOps pipeline that will:\n \n\nBuild an app, Azure Functions API, and Playwright tests\n Deploy the app to a staging environment\nAutomatically validate the staging app with the Playwright tests\nWait for a manual approval\nDeploy your app to production\n\n \nSample a…",
          "link": "https://techcommunity.microsoft.com/t5/apps-on-azure-blog/multi-stage-azure-static-web-apps-deployments-with-azure-devops/ba-p/3390625",
          "publishedOn": "2022-05-18T16:42:54.000Z",
          "wordCount": 2417,
          "title": "Multi-stage Azure Static Web Apps deployments with Azure DevOps",
          "imageUrl": "https://techcommunity.microsoft.com/t5/image/serverpage/image-id/372716i92E10C79F4CC7A13/image-size/original?v=v2&px=-1"
        },
        {
          "id": "https://techcommunity.microsoft.com/t5/apps-on-azure-blog/connected-micro-services-with-azure-arc-enabled-kubernetes-and/ba-p/3319996",
          "author": "monojit18",
          "description": "Introduction\nAzure Arc provides a simplified Governance and Management capability by delivering a consistent multi-cloud and on-premises management platform. Azure Arc-enabled Kubernetes allows us to on-board and manage Kubernetes clusters running anywhere - clusters running on other public cloud providers (GCP or AWS) or clusters running on on-premise data-centers (VMware vSphere or Azure Stack HCI) to Azure Arc. Azure Arc-enabled data services allows us to run Azure data services like SQL Managed Instance or PostgreSQL Hyperscale (preview) anywhere using Kubernetes.\n \nWhat are we going to build?\n\n \nIn this article we will build an end-to-end flow of a connected set of simple micro-services and an SQL Managed Instance all deployed on an AKS cluster. The same example can be extended to dep…",
          "link": "https://techcommunity.microsoft.com/t5/apps-on-azure-blog/connected-micro-services-with-azure-arc-enabled-kubernetes-and/ba-p/3319996",
          "publishedOn": "2022-05-17T11:52:44.000Z",
          "wordCount": 4231,
          "title": "Connected Micro-services with Azure Arc-enabled Kubernetes and Data Services",
          "imageUrl": "https://techcommunity.microsoft.com/t5/image/serverpage/image-id/372232iC59BE7EAC133B0B6/image-size/original?v=v2&px=-1"
        },
        {
          "id": "https://techcommunity.microsoft.com/t5/apps-on-azure-blog/diagnose-app-service-web-apps-performance-issues-and-failing/ba-p/3339437",
          "author": "Weizhen_Sun",
          "description": "After setup web app on Azure App Service, some customers might experience high response time, slowness, timeout etc performance issues or HTTP 500 internal server error issues with their app occasionally. Most HTTP 500 internal server error issues are likely to be caused by the unhandled exceptions thrown out by the application code. Besides monitoring the resources usage(CPU, memory, TCP connections etc) for the app service plan using \"Metrics\" under \"Monitoring\" from the Azure App Service portal, customers can further troubleshoot and diagnose these kinds of issues with Application Insights.\n \nApplication Insights is an important and powerful tool for diagnosing Azure App Service web apps' performance issues and requests failing issues. You can find it from Azure App Service portal-> Set…",
          "link": "https://techcommunity.microsoft.com/t5/apps-on-azure-blog/diagnose-app-service-web-apps-performance-issues-and-failing/ba-p/3339437",
          "publishedOn": "2022-05-15T06:25:47.000Z",
          "wordCount": 1080,
          "title": "Diagnose App Service Web Apps' Performance Issues And Failing Issues Using Application Insights",
          "imageUrl": "https://techcommunity.microsoft.com/t5/image/serverpage/image-id/370004iABB0DB437FFB85C9?v=v2"
        },
        {
          "id": "https://techcommunity.microsoft.com/t5/apps-on-azure-blog/blazor-webassembly-for-headless-cms-on-azure-static-web-apps/ba-p/3348808",
          "author": "justinyoo",
          "description": "One of the most popular scenarios to build a static website is to run a blog site for myself or my organisation. WordPress is the most popular service for this purpose. Now, you want to migrate your WordPress blog site to a static website, but it doesn't look easy.\n \nWhat if you still want to use the WordPress site to write content but only want to refresh the UI outside the site? What if you can even use C# for it through Blazor WebAssembly? You are now able to use the existing WordPress site as the data source of truth and build a UI in a separate instance with your preferred method. Does that sound attractive?\n \nThroughout this post, I'm going to discuss how to use the serviced WordPress instance as the headless CMS, build the Blazor WebAssembly app to make use of the WordPress as a dat…",
          "link": "https://techcommunity.microsoft.com/t5/apps-on-azure-blog/blazor-webassembly-for-headless-cms-on-azure-static-web-apps/ba-p/3348808",
          "publishedOn": "2022-05-14T00:00:00.000Z",
          "wordCount": 1995,
          "title": "Blazor WebAssembly for Headless CMS on Azure Static Web Apps",
          "imageUrl": "https://techcommunity.microsoft.com/t5/image/serverpage/image-id/370407iE297CE62F955D95C/image-size/original?v=v2&px=-1"
        }
      ]
    },
    {
      "title": "Microsoft Tech Community - Latest Blogs - Azure Developer Community Blog",
      "feedUrl": "https://techcommunity.microsoft.com/plugins/custom/microsoft/o365/custom-blog-rss?tid=-2574164104208876465&board=AzureDevCommunityBlog&size=100",
      "siteUrl": "https://techcommunity.microsoft.com",
      "articles": [
        {
          "id": "https://techcommunity.microsoft.com/t5/azure-developer-community-blog/transform-your-rest-apis-into-graphql-with-azure-api-management/ba-p/3472195",
          "author": "adrian_hall",
          "description": "One of the features that Azure API Management introduced at BUILD 2022 was Synthetic GraphQL – building a GraphQL service from a set of REST APIs.  GraphQL is still relatively new - at least compared to REST and SOAP - but it provides advantages over REST APIs when dealing with client applications.  Firstly, the client can fetch all the data it needs to render a page in one request, whereas when the data is modeled for REST, it generally takes multiple requests to get all the data.  Secondly, the client can request what data it is interested in for rendering the page and the server returns just that data.  RESTful APIs normally have a static set of fields that are returned.  A client application rarely uses all the fields, so data is transferred and then thrown away.\n \nAzure API Management…",
          "link": "https://techcommunity.microsoft.com/t5/azure-developer-community-blog/transform-your-rest-apis-into-graphql-with-azure-api-management/ba-p/3472195",
          "publishedOn": "2022-06-06T15:56:09.000Z",
          "wordCount": 1431,
          "title": "Transform your REST APIs into GraphQL with Azure API Management",
          "imageUrl": "https://techcommunity.microsoft.com/t5/image/serverpage/image-id/377853i5BE88ECAAEAC43D6?v=v2"
        },
        {
          "id": "https://techcommunity.microsoft.com/t5/azure-developer-community-blog/my-visual-guide-to-msbuild-keynote-10-things-to-know/ba-p/3440545",
          "author": "nityan",
          "description": "Just in case you missed it, Microsoft Build 2022 happened this past week (May 24-May 26) and it was a packed conference with 330+ sessions according to the schedule. As I do every year, I paid most attention to the opening keynote from Satya Nadella which often provides the high-level roadmap of core themes and exciting announcements that we can then use to find and attend deep-dive sessions into our topics of interest.\n \nThis year, the keynote was more packed with announcements than usual. As I do every year, I sketch-noted the entire thing and as you can see there was a lot of information covered.  If you're a visual-spatial learner, having a 1-page cheatsheet might help so I thought I'd share it. \n\nIf you want to share the image, there's a tweet to make that easier .\nIf you're curious. …",
          "link": "https://techcommunity.microsoft.com/t5/azure-developer-community-blog/my-visual-guide-to-msbuild-keynote-10-things-to-know/ba-p/3440545",
          "publishedOn": "2022-05-28T00:08:55.000Z",
          "wordCount": 1489,
          "title": "My Visual Guide to #MSBuild Keynote: 10 Things To Know",
          "imageUrl": "https://techcommunity.microsoft.com/t5/image/serverpage/image-id/375890i893ADF49B84EB522/image-size/original?v=v2&px=-1"
        },
        {
          "id": "https://techcommunity.microsoft.com/t5/azure-developer-community-blog/introducing-the-new-ramp-up-guide-for-developers-azure-skills/ba-p/3431731",
          "author": "BrendaSu",
          "description": "We are excited to introduce the new Azure Skills Navigator, our very own guide to help developers get started on Azure. We have a large collection of resources to help developers new to the cloud, and this guide curates all our best-in-class content in one place, making it easier to find and navigate. It is very important to stay ahead of the tech curve and continue to learn new skills in today’s competitive market, especially with the recent surge in demand for professionals skilled in cloud technologies. We hear you, and we are here to help. Our Azure Skills Navigator guide ensures that you have a solid foundation as you begin to explore Azure.\n \nAzure Skills Navigator will provide a unique learning journey designed for developers building apps with low-code techniques to simplify, autom…",
          "link": "https://techcommunity.microsoft.com/t5/azure-developer-community-blog/introducing-the-new-ramp-up-guide-for-developers-azure-skills/ba-p/3431731",
          "publishedOn": "2022-05-26T06:40:19.000Z",
          "wordCount": 935,
          "title": "Introducing the new ramp-up guide for developers, Azure Skills Navigator",
          "imageUrl": "https://techcommunity.microsoft.com/t5/image/serverpage/image-id/375359iD72234ED6EF6671E?v=v2"
        },
        {
          "id": "https://techcommunity.microsoft.com/t5/azure-developer-community-blog/azure-static-web-apps-cli-is-now-ga-general-availability/ba-p/3429213",
          "author": "Chris_Noring",
          "description": "What is Azure Static Web Apps or SWA (Static Web Apps)\nAzure Static Web Apps is a service that's perfect for your full stack as well as static files projects. Yes, you heard that correctly. Regardless if you are dealing with:\n\nA static resume site\nSPA application\nStatic site generator like Gatsby etc\n\nAzure Static Web Apps is there for you and enables you to deploy your files to Azure.\n\nhow does that work?\n\nWhen you create an Azure resource, it connects your GitHub repo to Azure via workflow file in yaml. This ensures that all your future work can be pushed to Azure with nothing but Git and GitHub.\n\nhttps://azure.microsoft.com/en-us/services/app-service/static/\n\nSounds like it's worth trying? If, so have a look at these resources\n\nhttps://docs.microsoft.com/en-us/learn/paths/azure-static-web-apps/\nhttps://docs.microsoft.com/en-us/azure/static-web-apps/overview\n\nWhat is Azure Static Web Apps CLI?\nIt's a CLI you run from your console. With it, you can do a lot of things like the below:\n\nWork on your JAMstack app locally\nBuilt-in framework detection\nServerless support\nAuthentication & Authorization\nLogin to Azure\nDeploy & Ship from the CLI\nNew documentation site\n\nCheck it out, how it can accelerate your workflow building SWA apps :)\n\nhttps://github.com/Azure/static-web-apps-cli",
          "link": "https://techcommunity.microsoft.com/t5/azure-developer-community-blog/azure-static-web-apps-cli-is-now-ga-general-availability/ba-p/3429213",
          "publishedOn": "2022-05-25T17:15:10.000Z",
          "wordCount": 778,
          "title": "Azure Static Web Apps CLI is now GA (general availability)",
          "imageUrl": "https://techcommunity.microsoft.com/t5/image/serverpage/image-id/375025i8D5020F34C8BD837/image-size/original?v=v2&px=-1"
        },
        {
          "id": "https://techcommunity.microsoft.com/t5/azure-developer-community-blog/protect-augment-and-build-graphql-apis-with-azure-api-management/ba-p/3396388",
          "author": "adrian_hall",
          "description": "REST APIs have been with us for over 20 years now.  In that time, our expectations of client applications have grown.  We expect client applications to run on mobile devices with low bandwidth, yet still be responsive.  Unfortunately, REST APIs restrict us in three basic ways:\n\nIt takes too many requests to fulfill the data needs for a single page.\nThe REST API returns too much data for the page being rendered.\nThe client application needs to poll to get new information.\n\nThere have been various attempts to solve these issues, and the current favorite is GraphQL.  GraphQL is a protocol specification that explicitly solves these issues.  The client application can specify the data they need to render a page in a query document that is sent as a single request to the GraphQL service.  A clie…",
          "link": "https://techcommunity.microsoft.com/t5/azure-developer-community-blog/protect-augment-and-build-graphql-apis-with-azure-api-management/ba-p/3396388",
          "publishedOn": "2022-05-24T16:07:06.000Z",
          "wordCount": 1393,
          "title": "Protect, Augment, and Build GraphQL APIs with Azure API Management",
          "imageUrl": "https://techcommunity.microsoft.com/t5/image/serverpage/image-id/372987i15A1A3F93F6CDC08?v=v2"
        },
        {
          "id": "https://techcommunity.microsoft.com/t5/azure-developer-community-blog/introducing-azure-deployment-environments/ba-p/3412095",
          "author": "sagar_lankala",
          "description": "Over the last several years, DevOps has fundamentally changed the way we develop software. New processes and tools have empowered developers to do more in less time, all while working towards increasingly complex applications. Yet for many organizations, providing developers with the complex infrastructure needed to deploy, test, and run their apps remains a challenge due to the difficulty of balancing agility with security and compliance.\n \nToday, we are excited to announce Azure Deployment Environments, a new cloud service that empowers development teams to quickly spin up their app infrastructure with self-service of project-based infrastructure-as-code templates that minimize set-up time while maximizing security, compliance, and cost efficiency.\n \nYou can sign up for the waiting list …",
          "link": "https://techcommunity.microsoft.com/t5/azure-developer-community-blog/introducing-azure-deployment-environments/ba-p/3412095",
          "publishedOn": "2022-05-24T15:00:01.000Z",
          "wordCount": 1214,
          "title": "Introducing Azure Deployment Environments",
          "imageUrl": "https://techcommunity.microsoft.com/t5/image/serverpage/image-id/374062i3BF2F91775EBB521?v=v2"
        },
        {
          "id": "https://techcommunity.microsoft.com/t5/azure-developer-community-blog/introducing-microsoft-dev-box/ba-p/3412063",
          "author": "acangialosi",
          "description": "Maintaining a developer workstation that can build, run, and debug your application is critical to keeping up with the pace of modern development teams. As developers, we need the flexibility to set up and maintain our workstation, but even ‘small changes’ can unexpectedly poison our dev environments, interrupting our flow and costing hours to undo.\nAt the same time, many IT organizations are struggling to provide dev teams with the flexibility they need to stay productive. Hardware requirements for developer workstations can change rapidly as projects evolve, and an increase in hybrid development teams means it’s more difficult than ever to get developers the resources they need.\nToday, we are excited to announce Microsoft Dev Box, a new cloud service that provides developers with secure,…",
          "link": "https://techcommunity.microsoft.com/t5/azure-developer-community-blog/introducing-microsoft-dev-box/ba-p/3412063",
          "publishedOn": "2022-05-24T15:00:01.000Z",
          "wordCount": 1515,
          "title": "Introducing Microsoft Dev Box",
          "imageUrl": "https://techcommunity.microsoft.com/t5/image/serverpage/image-id/374068iEFD32D2A1F88C0D2?v=v2"
        }
      ]
    },
    {
      "title": "Microsoft Tech Community - Latest Blogs - Messaging on Azure Blog",
      "feedUrl": "https://techcommunity.microsoft.com/plugins/custom/microsoft/o365/custom-blog-rss?tid=-2574164104208876465&board=MessagingonAzureBlog&size=100",
      "siteUrl": "https://techcommunity.microsoft.com",
      "articles": [
        {
          "id": "https://techcommunity.microsoft.com/t5/messaging-on-azure-blog/new-event-sources-for-event-grid-azure-ad-outlook-teams/ba-p/3489471",
          "author": "Javier_Fernandez",
          "description": "Event Grid is a highly scalable, serverless event broker you can use to integrate applications using event-driven architectures. We are now announcing the availability (preview) of new event sources through the integration of Microsoft Graph API (MGA) with Azure Event Grid. Through this partnership, Microsoft Graph API notifications publishes events associated to its supported event sources. With Azure Event Grid you are now able to subscribe to events from the following resources ():\n \n\n\n\n\nMicrosoft event source\n\n\nResources supported to subscribe to events\n\n\n\n\nAzure Active Directory\n\n\n•       User\n•       Group\n\n\n\n\nMicrosoft Outlook\n\n\n•       Event (calendar meetings)\n•       Message (emails)\n•       Contact\n\n\n\n\nMicrosoft Conversations\n\n\n•       Conversation\n\n\n\n\nMicrosoft Teams\n\n\n•       …",
          "link": "https://techcommunity.microsoft.com/t5/messaging-on-azure-blog/new-event-sources-for-event-grid-azure-ad-outlook-teams/ba-p/3489471",
          "publishedOn": "2022-06-09T23:29:31.000Z",
          "wordCount": 1326,
          "title": "New event sources for Event Grid: Azure AD, Outlook, Teams, SharePoint, security alerts, etc.",
          "imageUrl": "https://techcommunity.microsoft.com/t5/image/serverpage/image-id/379065i58896482D7BC808E?v=v2"
        },
        {
          "id": "https://techcommunity.microsoft.com/t5/messaging-on-azure-blog/announcing-service-bus-explorer-for-azure-portal-public-preview/ba-p/3417168",
          "author": "EldertGrootenboer",
          "description": "Today we are pleased to announce the preview of the completely revamped Service Bus Explorer tool on the Azure portal. Azure Service Bus has two types of operations which can be performed against it:\n \n\nManagement operations; Create, update, delete of Service Bus namespace, queues, topics, and subscriptions.\nData operations; Send to and receive messages from queues, topics, and subscriptions.\n\n \nWhile we have offered a portal-based Service Bus Explorer for data operations for a while now, our customers have provided us with feedback that the experience was still lacking compared to the community managed Service Bus Explorer OSS tool.\n \nTo empower our customers even further, we are now releasing a new version of Service Bus Explorer, which brings many new capabilities to the portal for work…",
          "link": "https://techcommunity.microsoft.com/t5/messaging-on-azure-blog/announcing-service-bus-explorer-for-azure-portal-public-preview/ba-p/3417168",
          "publishedOn": "2022-05-24T18:30:00.000Z",
          "wordCount": 911,
          "title": "Announcing Service Bus Explorer for Azure portal public preview",
          "imageUrl": "https://techcommunity.microsoft.com/t5/image/serverpage/image-id/374285iD5DCEDAEAFAF3928?v=v2"
        },
        {
          "id": "https://techcommunity.microsoft.com/t5/messaging-on-azure-blog/azure-event-hubs-capture-event-streams-in-parquet-format-to-data/ba-p/3418086",
          "author": "Kasun_Indrasiri",
          "description": "Azure Event Hubs enables you to stream millions of events per second from any source using Kafka, AMQP or HTTPS protocols. Using Event Hubs capture feature, you can load real-time streaming data to data lakes, warehouses, and other storage services, so that they can be processed or analyzed by analytics services. \n \nToday we are excited to announce the preview of Apache Parquet capturing support in Azure Event Hubs. \n \nWhy Apache Parquet for big data analytics?\nApache Parquet is column-oriented storage format that is designed for efficient data storage and retrieval. It’s open source and is not tied to any processing framework, data model or programming language. Parquet is ideal for storing any kind of big data and is built to support efficient compression and encoding schemes.  \n \nCapture streaming data in Parquet format using Event Hubs\nUsing Azure Event Hubs, no code editor for event processing, you can automatically capture streaming data in an Azure Data Lake Storage Gen2 account in Parquet format. The no code editor allows you to easily develop an Azure Stream Analytics job without writing a single line of code.\n \n\nOnce data is captured, any analytics service of your choice can process or analyze Parquet data. \n \nGet Started Today\nYou can try out Apache Parquet capturing feature in Azure Event Hubs using the following links.\n\nTo try out Parquet capturing feature, follow Capture data from Event Hubs in Parquet format.\nYou can follow the tutorial on Capture Event Hubs data in Parquet format and analyze with Azure Synapse Analytics. \nTo learn more about no code editor in Event Hubs for event stream processing, check out No code stream processing using Azure Stream Analytics (Preview).",
          "link": "https://techcommunity.microsoft.com/t5/messaging-on-azure-blog/azure-event-hubs-capture-event-streams-in-parquet-format-to-data/ba-p/3418086",
          "publishedOn": "2022-05-24T17:27:53.000Z",
          "wordCount": 887,
          "title": "Azure Event Hubs - Capture event streams in Parquet format to data lakes and warehouses",
          "imageUrl": "https://techcommunity.microsoft.com/t5/image/serverpage/image-id/374412i4E4964D2986D5055?v=v2"
        },
        {
          "id": "https://techcommunity.microsoft.com/t5/messaging-on-azure-blog/resource-governance-for-client-applications-public-preview-in/ba-p/3417987",
          "author": "Kasun_Indrasiri",
          "description": "Azure Event Hubs enables you to stream millions of events per second from numerous client applications using AMQP or Apache Kafka protocols. When you stream events to and from Azure Event Hubs using different event streaming applications, you often need to govern those workloads individually. For instance, you may have to prioritize certain workloads while you throttle the other workloads beyond a certain throughput limit. Therefore, fine-grained governance of client application workloads that stream data to and from Event Hubs is a common business requirement. \n \nToday we are happy to announce the public preview of Resource governance for client applications with application groups. Using application groups, you can create logical groupings between client applications that connect (publis…",
          "link": "https://techcommunity.microsoft.com/t5/messaging-on-azure-blog/resource-governance-for-client-applications-public-preview-in/ba-p/3417987",
          "publishedOn": "2022-05-24T16:35:38.000Z",
          "wordCount": 1060,
          "title": "Resource governance for client applications (Public Preview) in Azure Event Hubs",
          "imageUrl": "https://techcommunity.microsoft.com/t5/image/serverpage/image-id/374388iE67EA16296F5A0DD?v=v2"
        },
        {
          "id": "https://techcommunity.microsoft.com/t5/messaging-on-azure-blog/benchmarking-azure-event-hubs-premium-for-kafka-and-amqp/ba-p/3377483",
          "author": "Kasun_Indrasiri",
          "description": "Azure Event Hubs is a fully managed, real-time data streaming service for your Kafka and AMQP event streaming workloads. We recently announced the general availability of Azure Event Hubs Premium, a new product tier that comes with a state-of-the-art event streaming architecture for high-end event streaming scenarios which require elastic, superior, and predictable performance.\nWith Premium, you get superior performance and better isolation for your event streaming workloads with in a managed multitenant PaaS environment.\n \nWe conducted a performance benchmarking test for Azure Event Hubs Premium and analyzed how it performs against Apache Kafka and AMQP workloads by focusing on performance metrics: end-to-end event streaming latency and event publishing latency.\n \nThis article provides yo…",
          "link": "https://techcommunity.microsoft.com/t5/messaging-on-azure-blog/benchmarking-azure-event-hubs-premium-for-kafka-and-amqp/ba-p/3377483",
          "publishedOn": "2022-05-24T13:53:16.000Z",
          "wordCount": 1959,
          "title": "Benchmarking Azure Event Hubs Premium for Kafka and AMQP workloads",
          "imageUrl": "https://techcommunity.microsoft.com/t5/image/serverpage/image-id/374718i55EE760081C09EE2/image-size/original?v=v2&px=-1"
        }
      ]
    },
    {
      "title": "Microsoft Tech Community - Latest Blogs - Azure Architecture Blog",
      "feedUrl": "https://techcommunity.microsoft.com/plugins/custom/microsoft/o365/custom-blog-rss?tid=-2574164104208876465&board=AzureArchitectureBlog&size=50",
      "siteUrl": "https://techcommunity.microsoft.com",
      "articles": [
        {
          "id": "https://techcommunity.microsoft.com/t5/azure-architecture-blog/armchair-architects-the-land-of-iot/ba-p/3478756",
          "author": "brauerblogs",
          "description": "Designing modern applications that may include legacy components introduces unique challenges to the world of cloud architecture. IoT-related architecture can be different than other architecture.\n \nThe first thing to point out in this landscape is that there are two distinct scenarios: brownfield and greenfield. Anytime you’re building something new, such as a factory, building or car, and you want to include Internet connected devices or components, you are working within a greenfield scenario. Anytime you want to connect existing devices and assets that may have been around for years to decades, this typically is a brownfield scenario.  The assets or devices were not designed to be network or internet connected by default. Thus, a retrofit methodology is required. In many cases, brownfi…",
          "link": "https://techcommunity.microsoft.com/t5/azure-architecture-blog/armchair-architects-the-land-of-iot/ba-p/3478756",
          "publishedOn": "2022-06-07T19:21:39.000Z",
          "wordCount": 1928,
          "title": "Armchair Architects: The “Land of IoT”",
          "imageUrl": "https://techcommunity.microsoft.com/t5/image/serverpage/image-id/378289i0CBF8C90D7294124/image-size/original?v=v2&px=-1"
        },
        {
          "id": "https://techcommunity.microsoft.com/t5/azure-architecture-blog/armchair-architects-the-edge-computing-model/ba-p/3456575",
          "author": "brauerblogs",
          "description": "So, what is “edge computing”? It’s a compute environment of different sizes that exists on-premises that helps customers and solutions do things like aggregate, filter, or inference on data that’s coming from devices that are connected to that on-premises environment. In many cases, there’s a spectrum of devices and we can go from constrained edge devices to data-class edge devices, all with different levels of computer power and complexity. There are different types of solutions and places where you can host AI models, filtering models, database components, all for the purpose of doing things in the premises world before they actually connect to the cloud and send data to the cloud.\n \nAnother key reason it is called “Edge” (you could do all of the above with many types of traditional on-p…",
          "link": "https://techcommunity.microsoft.com/t5/azure-architecture-blog/armchair-architects-the-edge-computing-model/ba-p/3456575",
          "publishedOn": "2022-06-01T22:27:49.000Z",
          "wordCount": 1542,
          "title": "Armchair Architects: The edge computing model",
          "imageUrl": "https://techcommunity.microsoft.com/t5/image/serverpage/image-id/376939iFDF8492F5EAFE765/image-size/original?v=v2&px=-1"
        },
        {
          "id": "https://techcommunity.microsoft.com/t5/azure-architecture-blog/improving-developer-velocity-a-case-study/ba-p/3417620",
          "author": "haomsft",
          "description": "Introduction\n \nIn a paper published by McKinsey titled Developer Velocity: How software excellence fuels business performance, it states that companies with top \"Developer Velocity Index (DVI)\" outperform the market with 4-5 times revenue grow and 55% higher innovation (\"Measured by level of adoption of new technologies and ability to innovate faster and beat competition through innovation led growth\"). To learn more about Developer Velocity, you can download a copy of the white paper on this Azure page.\n \nFrom the McKinsey paper, Developer Velocity is defined as the ability to drive transformative business performance through software development. Empowering developers, creating the right environment to innovate, and removing points of friction can all contribute to a high Developer Veloc…",
          "link": "https://techcommunity.microsoft.com/t5/azure-architecture-blog/improving-developer-velocity-a-case-study/ba-p/3417620",
          "publishedOn": "2022-05-26T18:03:30.000Z",
          "wordCount": 2853,
          "title": "Improving Developer Velocity - a Case Study",
          "imageUrl": "https://techcommunity.microsoft.com/t5/image/serverpage/image-id/374791iF25DF95359397928/image-size/original?v=v2&px=-1"
        },
        {
          "id": "https://techcommunity.microsoft.com/t5/azure-architecture-blog/optimizing-azure-virtual-machines-with-the-well-architected/ba-p/3430865",
          "author": "jasonbouska",
          "description": "Azure Virtual Machines are an integral part of cloud computing that when deployed effectively can provide a secure, scalable, fault-tolerant, and cost-effective way to rapidly deploy and manage your infrastructure on Azure – all without the up-front expense and challenge of purchasing and managing physical hardware on your own. Azure also supports Virtual Machine Scale Sets, which adds additional flexibility by allowing your infrastructure to dynamically scale based on demand while increasing resiliency in an intelligent and cost-effective manner.\n \nThe Microsoft Azure Well-Architected Framework provides guiding tenets designed to assist you in achieving architectural excellence on Azure. The five pillars of a Well-Architected Framework are: cost management, operational excellence, perform…",
          "link": "https://techcommunity.microsoft.com/t5/azure-architecture-blog/optimizing-azure-virtual-machines-with-the-well-architected/ba-p/3430865",
          "publishedOn": "2022-05-26T15:01:40.000Z",
          "wordCount": 914,
          "title": "Optimizing Azure Virtual Machines with the Well-Architected Framework",
          "imageUrl": "https://techcommunity.microsoft.com/t5/image/serverpage/image-id/375318iE228363EADB8A9B0/image-size/original?v=v2&px=-1"
        },
        {
          "id": "https://techcommunity.microsoft.com/t5/azure-architecture-blog/optimizing-azure-kubernetes-service-aks-with-the-well/ba-p/3352848",
          "author": "ckittel",
          "description": "The Azure Well-Architected Framework assists architects in the creation and review of their cloud workloads with guidance spanning five pillars – reliability, security, cost optimization, operational excellence, and performance efficiency. These are cross-cutting and cover the entire scope of the workload. Additionally, it's often beneficial for an architect to focus on a core component of the workload, and the Well-Architected Framework also delivers targeted, service-specific guidance on key workload components.\n \nToday we’re going to be looking at the Azure Well-Architected Azure Kubernetes Service (AKS) guide. Like all the Well-Architected Framework service guides, the Azure Kubernetes Service (AKS) guide delivers checklists and recommendations across the same five pillars, but with a …",
          "link": "https://techcommunity.microsoft.com/t5/azure-architecture-blog/optimizing-azure-kubernetes-service-aks-with-the-well/ba-p/3352848",
          "publishedOn": "2022-05-16T15:28:42.000Z",
          "wordCount": 1252,
          "title": "Optimizing Azure Kubernetes Service (AKS) with the Well-Architected Framework",
          "imageUrl": "https://techcommunity.microsoft.com/t5/image/serverpage/image-id/370509i4ADE816452BE0548?v=v2"
        }
      ]
    },
    {
      "title": "Microsoft Tech Community - Latest Blogs - Azure Migration and Modernization Blog",
      "feedUrl": "https://techcommunity.microsoft.com/plugins/custom/microsoft/o365/custom-blog-rss?tid=-2574164104208876465&board=AzureMigrationBlog&size=50",
      "siteUrl": "https://techcommunity.microsoft.com",
      "articles": []
    },
    {
      "title": "Microsoft Azure Blog > Developer",
      "feedUrl": "https://azurecomcdn.azureedge.net/en-us/blog/topics/developer/feed/",
      "siteUrl": "https://azure.microsoft.com/blog/topics/developer/",
      "articles": [
        {
          "id": "code-test-and-ship-your-next-app-quickly-and-securely-with-microsoft-developer-tools",
          "author": "Kathleen Mitford",
          "description": "Welcome to Microsoft Build, the event that’s all about celebrating the developer community! The work you do has the power to transform entire industries and keep critical businesses and services running through innovative solutions and applications. I couldn’t be more honored to champion this entire dev community as you create the future.",
          "link": "https://azure.microsoft.com/blog/code-test-and-ship-your-next-app-quickly-and-securely-with-microsoft-developer-tools/",
          "publishedOn": "2022-05-24T08:00:02.000Z",
          "wordCount": 5595,
          "title": "Code, test, and ship your next app quickly and securely with Microsoft developer tools",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "scale-your-cloudnative-apps-and-accelerate-app-modernization-with-azure-the-best-cloud-for-your-apps",
          "author": "Scott Guthrie",
          "description": "Microsoft was founded as a developer tools company, and developers remain at the very center of our mission. Today, we have the most used and beloved developer tools with Visual Studio, .NET, and GitHub. We offer a trusted and comprehensive platform to build amazing apps and solutions that help enable people and organizations across the planet to achieve more.",
          "link": "https://azure.microsoft.com/blog/scale-your-cloudnative-apps-and-accelerate-app-modernization-with-azure-the-best-cloud-for-your-apps/",
          "publishedOn": "2022-05-24T08:00:02.000Z",
          "wordCount": 5906,
          "title": "Scale your cloud-native apps and accelerate app modernization with Azure, the best cloud for your apps",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "introducing-the-microsoft-intelligent-data-platform",
          "author": "Rohan Kumar",
          "description": "It’s clear that the fragmentation which exists today between databases, analytics, and governance products must be addressed. To help organizations unlock these new capabilities, we shared several exciting announcements today at Microsoft Build that demonstrate our continued innovation and investment in the data products our customers have come to know and trust.",
          "link": "https://azure.microsoft.com/blog/introducing-the-microsoft-intelligent-data-platform/",
          "publishedOn": "2022-05-24T08:00:01.000Z",
          "wordCount": 5648,
          "title": "Introducing the Microsoft Intelligent Data Platform",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        }
      ]
    },
    {
      "title": "Microsoft for Java Developers",
      "feedUrl": "https://devblogs.microsoft.com/java/feed/",
      "siteUrl": "https://devblogs.microsoft.com/java",
      "articles": [
        {
          "id": "https://devblogs.microsoft.com/java/?p=229090",
          "author": "Jialuo Gan",
          "description": "Hi everyone, welcome back to June update of Java on Azure Tooling. In this update, we will introduce the new application-centric view on Azure toolkit for IntelliJ that will make the interface more user-friendly. In addition, we have added support for more Azure services.\nThe post Java on Azure Tooling Update – June 2022 appeared first on Microsoft for Java Developers.",
          "link": "https://devblogs.microsoft.com/java/java-on-azure-tooling-update-june-2022/",
          "publishedOn": "2022-06-02T07:25:51.000Z",
          "wordCount": 1430,
          "title": "Java on Azure Tooling Update – June 2022",
          "imageUrl": "https://devblogs.microsoft.com/java/wp-content/uploads/sites/51/2022/06/June-update-2022-new.png"
        },
        {
          "id": "https://devblogs.microsoft.com/java/?p=229066",
          "author": "Brian Stafford",
          "description": "Introduction\nThe post Debugging a JVM Crash for LinkedIn – Part 3 appeared first on Microsoft for Java Developers.",
          "link": "https://devblogs.microsoft.com/java/debugging-a-jvm-crash-for-linkedin-part-3/",
          "publishedOn": "2022-06-01T15:37:02.000Z",
          "wordCount": 1642,
          "title": "Debugging a JVM Crash for LinkedIn – Part 3",
          "imageUrl": "https://devblogs.microsoft.com/java/wp-content/uploads/sites/51/2019/11/trexduke-blackwhite-cropped-half.png"
        },
        {
          "id": "https://devblogs.microsoft.com/java/?p=229009",
          "author": "Nick Zhu",
          "description": "Hi everyone, welcome to the May update of Visual Studio Code Java. In this month’s update, we are going to share exciting improvements to our user experience regarding signature help and code completion as well as new Gradle features. Let’s get started!\nThe post Java on Visual Studio Code Update – May 2022 appeared first on Microsoft for Java Developers.",
          "link": "https://devblogs.microsoft.com/java/java-on-visual-studio-code-update-may-2022/",
          "publishedOn": "2022-05-23T04:56:19.000Z",
          "wordCount": 1259,
          "title": "Java on Visual Studio Code Update – May 2022",
          "imageUrl": "https://devblogs.microsoft.com/java/wp-content/uploads/sites/51/2022/05/englishcover.png"
        },
        {
          "id": "https://devblogs.microsoft.com/java/?p=228970",
          "author": "Brian Stafford",
          "description": "Introduction\nThe post Debugging a JVM Crash for LinkedIn – Part 2 appeared first on Microsoft for Java Developers.",
          "link": "https://devblogs.microsoft.com/java/debugging-a-jvm-crash-for-linkedin-part-2/",
          "publishedOn": "2022-05-17T17:34:14.000Z",
          "wordCount": 1811,
          "title": "Debugging a JVM Crash for LinkedIn – Part 2",
          "imageUrl": "https://devblogs.microsoft.com/java/wp-content/uploads/sites/51/2022/05/gdb-300x294.png"
        }
      ]
    },
    {
      "title": "Developer Support",
      "feedUrl": "https://devblogs.microsoft.com/premier-developer/feed/",
      "siteUrl": "https://devblogs.microsoft.com/premier-developer",
      "articles": [
        {
          "id": "https://devblogs.microsoft.com/premier-developer/?p=40860",
          "author": "Developer Support",
          "description": "Susan Leighton spotlights the Planetary Computer, combining a multi-petabyte catalog of global environmental data with intuitive APIs, a flexible scientific environment that allows users to answer global questions about that data, and applications that put those answers in the hands of conservation stakeholders.\nThe post The Microsoft Planetary Computer appeared first on Developer Support.",
          "link": "https://devblogs.microsoft.com/premier-developer/the-microsoft-planetary-computer/",
          "publishedOn": "2022-06-08T07:33:05.000Z",
          "wordCount": 2031,
          "title": "The Microsoft Planetary Computer",
          "imageUrl": "https://devblogs.microsoft.com/premier-developer/wp-content/uploads/sites/31/2022/06/planetarycomputer_fi.jpg"
        },
        {
          "id": "https://devblogs.microsoft.com/premier-developer/?p=40845",
          "author": "Developer Support",
          "description": "Tahir Naveed spotlights Express Design, a new way to quickly get started with Power Apps by instantly transforming your visual design into an app.\nAs soon as the announcement of Express Design came out on Microsoft Build, I wanted to get my hands dirty with it.\nThe post Express Design – AppDev on Steroids appeared first on Developer Support.",
          "link": "https://devblogs.microsoft.com/premier-developer/express-design-appdev-on-steroids/",
          "publishedOn": "2022-06-07T07:22:35.000Z",
          "wordCount": 1148,
          "title": "Express Design – AppDev on Steroids",
          "imageUrl": "https://devblogs.microsoft.com/premier-developer/wp-content/uploads/sites/31/2022/06/expressdesign.jpg"
        },
        {
          "id": "https://devblogs.microsoft.com/premier-developer/?p=40840",
          "author": "Developer Support",
          "description": "Mark Eisenberg and Keith Anderson spotlight app architecture, organizational structure, and testing responsibilities and the importance of how these areas can improve or hinder the effectiveness of DevOps practices.\nOverview\nThe post DevOps Fragility, Antipatterns, and Consequences appeared first on Developer Support.",
          "link": "https://devblogs.microsoft.com/premier-developer/devops-fragility-antipatterns-and-consequences/",
          "publishedOn": "2022-06-06T07:52:22.000Z",
          "wordCount": 2361,
          "title": "DevOps Fragility, Antipatterns, and Consequences",
          "imageUrl": "https://devblogs.microsoft.com/premier-developer/wp-content/uploads/sites/31/2022/06/DevOps_AP_FI.jpg"
        },
        {
          "id": "https://devblogs.microsoft.com/premier-developer/?p=40800",
          "author": "Developer Support",
          "description": "Stephen Abdo and Pete Tian examine cloud-agnostic strategies and explore common challenges and misconceptions.\nOverview and Industry Trends\nThe post Kubernetes and Challenges in Cloud-Agnostic Strategies appeared first on Developer Support.",
          "link": "https://devblogs.microsoft.com/premier-developer/kubernetes-and-challenges-in-cloud-agnostic-strategies/",
          "publishedOn": "2022-06-03T07:35:12.000Z",
          "wordCount": 1844,
          "title": "Kubernetes and Challenges in Cloud-Agnostic Strategies",
          "imageUrl": "https://devblogs.microsoft.com/premier-developer/wp-content/uploads/sites/31/2022/06/CloudDev_FI.jpg"
        },
        {
          "id": "https://devblogs.microsoft.com/premier-developer/?p=40791",
          "author": "Developer Support",
          "description": "Kyle Johnson and Sash Kavalaparambil explore batch import for Azure DevOps work items using REST APIs.\nWhile you can upload a CSV with work items into Azure DevOps, there is so much flexibility you get when you import work items using the Azure DevOps API.\nThe post How To Batch Importing Azure DevOps Work Items Using Azure DevOps APIs and C# appeared first on Developer Support.",
          "link": "https://devblogs.microsoft.com/premier-developer/how-to-batch-importing-azure-devops-work-items-using-azure-devops-apis-and-c/",
          "publishedOn": "2022-05-30T07:17:02.000Z",
          "wordCount": 1045,
          "title": "How To Batch Importing Azure DevOps Work Items Using Azure DevOps APIs and C#",
          "imageUrl": "https://devblogs.microsoft.com/premier-developer/wp-content/uploads/sites/31/2022/05/DevOps_API_fi.png"
        },
        {
          "id": "https://devblogs.microsoft.com/premier-developer/?p=40764",
          "author": "Developer Support",
          "description": "Randy Pagels takes you on a DevOps journey to frame up the way an organization would foster a strong DevOps culture.\nContributions made to this blog post by Kyle Burns, Microsoft Cloud Solution Architect and Able Wang, former Principal Cloud Advocate and DevOps Lead at Microsoft,\nThe post DevOps Nirvana – Part 1 appeared first on Developer Support.",
          "link": "https://devblogs.microsoft.com/premier-developer/devops-nirvana-part-1/",
          "publishedOn": "2022-05-27T07:39:54.000Z",
          "wordCount": 3310,
          "title": "DevOps Nirvana – Part 1",
          "imageUrl": "https://devblogs.microsoft.com/premier-developer/wp-content/uploads/sites/31/2022/05/DevOpsJourney_fi.png"
        },
        {
          "id": "https://devblogs.microsoft.com/premier-developer/?p=40761",
          "author": "Developer Support",
          "description": "Tammy McClellan is an advocate for sustainability and the Green Software Foundation (GSF).  Learn more about how developers are putting this passion into practice.\nWhen Microsoft announced of the Green Software Foundation (GSF), I jumped at the opportunity to join the initiative and went all in –\nThe post Software Carbon Intensity? appeared first on Developer Support.",
          "link": "https://devblogs.microsoft.com/premier-developer/software-carbon-intensity/",
          "publishedOn": "2022-05-26T07:19:12.000Z",
          "wordCount": 999,
          "title": "Software Carbon Intensity?",
          "imageUrl": "https://devblogs.microsoft.com/premier-developer/wp-content/uploads/sites/31/2022/05/microsoft-global-hackathon-2021_fi.png"
        },
        {
          "id": "https://devblogs.microsoft.com/premier-developer/?p=40749",
          "author": "Developer Support",
          "description": "Bill Bevan spotlights row-level security at the user level with Power BI.\nHave you ever had to restrict data, but didn’t know how to filter per user? Using Power BI’s Row-level Security (RLS) is a great way to accomplish this. In this short blog you will be introduced to a scenario on how to do just that.\nThe post Implementing Power BI Row-level security (RLS) at the user level appeared first on Developer Support.",
          "link": "https://devblogs.microsoft.com/premier-developer/implementing-power-bi-row-level-security-rls-at-the-user-level/",
          "publishedOn": "2022-05-25T07:02:50.000Z",
          "wordCount": 1269,
          "title": "Implementing Power BI Row-level security (RLS) at the user level",
          "imageUrl": "https://devblogs.microsoft.com/premier-developer/wp-content/uploads/sites/31/2022/05/rowlevel_fi.jpg"
        },
        {
          "id": "https://devblogs.microsoft.com/premier-developer/?p=40744",
          "author": "Developer Support",
          "description": "In this post, Maor Frankel shares insights about performance regression testing in Microsoft Security.\nDuring the past 6 years, a significant amount of my work has gone into improving the performance of the Web application I work on.\nThe post Performance regression tests at Microsoft Security appeared first on Developer Support.",
          "link": "https://devblogs.microsoft.com/premier-developer/performance-regression-tests-at-microsoft-security/",
          "publishedOn": "2022-05-24T07:38:09.000Z",
          "wordCount": 1836,
          "title": "Performance regression tests at Microsoft Security",
          "imageUrl": "https://devblogs.microsoft.com/premier-developer/wp-content/uploads/sites/31/2022/05/MSC17_dataCenter_036_fi.jpg"
        },
        {
          "id": "https://devblogs.microsoft.com/premier-developer/?p=40728",
          "author": "Developer Support",
          "description": "Chris Tjoumas explores the power and flexibility of Azure Service Bus through some fun with Fantasy Football.\nFor the past 15 years, I’ve been playing fantasy football and probably spend too much time each Sunday during the regular season watching every single game.\nThe post Exploring Service Bus with Fantasy Football appeared first on Developer Support.",
          "link": "https://devblogs.microsoft.com/premier-developer/exploring-service-bus-with-fantasy-football/",
          "publishedOn": "2022-05-23T07:37:18.000Z",
          "wordCount": 3133,
          "title": "Exploring Service Bus with Fantasy Football",
          "imageUrl": "https://devblogs.microsoft.com/premier-developer/wp-content/uploads/sites/31/2022/05/fantasyfootball.png"
        }
      ]
    },
    {
      "title": "Azure DevOps Blog",
      "feedUrl": "https://devblogs.microsoft.com/devops/feed/",
      "siteUrl": "https://devblogs.microsoft.com/devops",
      "articles": [
        {
          "id": "https://devblogs.microsoft.com/devops/?p=64424",
          "author": "Art Garcia",
          "description": "So, we all love how we can manage engagements in Azure DevOps (ADO). We can create Epics, Features, User Stories and track our progress on Kanban boards. You can customize work item types to suit the needs of your business and project with ease.\nThe post Copy a work item type using Azure DevOps API’s appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/copy-a-work-item-type-using-azure-devops-apis-undocumented/",
          "publishedOn": "2022-06-09T13:33:30.000Z",
          "wordCount": 2619,
          "title": "Copy a work item type using Azure DevOps API’s",
          "imageUrl": "https://devblogs.microsoft.com/devops/wp-content/uploads/sites/6/2022/06/HERO-1.jpg"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=64394",
          "author": "DevOps Dojo",
          "description": "What is vision?\nThe post DevOps Dojo – OKRs (Objectives and Key Results) appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/devops-dojo-okrs-objectives-and-key-results/",
          "publishedOn": "2022-06-08T16:16:46.000Z",
          "wordCount": 4565,
          "title": "DevOps Dojo – OKRs (Objectives and Key Results)",
          "imageUrl": "https://devblogs.microsoft.com/devops/wp-content/uploads/sites/6/2021/11/DevOpsDojoFeaturedImage.png"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=64349",
          "author": "DevOps Dojo",
          "description": "In Part 1 and Part 2 of the DevOps Dojo – Lean Product series, we covered the why, what, and how of the product-centric model and lean product model as outlined in the White & Orange Belts of the DevOps Dojo.\nThe post DevOps Dojo: Lean Product – Part 3 appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/devops-dojo-lean-product-part-3/",
          "publishedOn": "2022-06-07T09:43:29.000Z",
          "wordCount": 5570,
          "title": "DevOps Dojo: Lean Product – Part 3",
          "imageUrl": "https://devblogs.microsoft.com/devops/wp-content/uploads/sites/6/2022/04/DojoHeader.png"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=64335",
          "author": "April Edwards",
          "description": "‘Don’t Accept the Defaults’ -Abel Wang\nThe post Top Stories from the Microsoft DevOps Community – 04.06.2022 appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/top-stories-from-the-microsoft-devops-community-04-06-2022/",
          "publishedOn": "2022-06-04T07:46:22.000Z",
          "wordCount": 1500,
          "title": "Top Stories from the Microsoft DevOps Community – 04.06.2022",
          "imageUrl": "https://devblogs.microsoft.com/devops/wp-content/uploads/sites/6/2022/03/agile.png"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=64299",
          "author": "Dan Hellem",
          "description": "As part of the Azure DevOps Server 2022 release, we wanted to reiterate the deprecation of the existing data warehouse reporting services. We previously announced this in the Azure DevOps Server 2020 release notes. The warehouse reporting service has been part of TFS and Azure DevOps for over a decade.\nThe post Azure DevOps Server 2022 Deprecation of Reporting Services appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/azure-devops-server-2022-deprecation-of-reporting-services/",
          "publishedOn": "2022-06-02T19:05:40.000Z",
          "wordCount": 1498,
          "title": "Azure DevOps Server 2022 Deprecation of Reporting Services",
          "imageUrl": "https://devblogs.microsoft.com/devops/wp-content/uploads/sites/6/2018/08/vstsfeature.png"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=64125",
          "author": "Dan Hellem",
          "description": "Every time a work item is updated, it creates an entry in the work item history. This is a great feature for users to track all the individual changes made to work items. However, we have seen organizations with automated tools that will generate tens of thousands of work item revisions.\nThe post Work Item Revision Limits appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/work-item-revision-limits/",
          "publishedOn": "2022-06-02T13:38:06.000Z",
          "wordCount": 1347,
          "title": "Work Item Revision Limits",
          "imageUrl": "https://devblogs.microsoft.com/devops/wp-content/uploads/sites/6/2022/03/agile.png"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=64092",
          "author": "April Edwards",
          "description": "Join us for episode 3 in our series DevOps for Java Shops! In this episode Brian Benz walks us through how to deploy a Java application to Azure App Service using GitHub Actions and continuous delivery!\nApril: [00:00:00] Tune in into this week’s episode of the DevOps lab,\nThe post Deploying Java Applications to Azure using Continuous Delivery appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/deploying-java-applications-to-azure-using-continuous-delivery/",
          "publishedOn": "2022-05-20T10:58:07.000Z",
          "wordCount": 2065,
          "title": "Deploying Java Applications to Azure using Continuous Delivery",
          "imageUrl": "https://devblogs.microsoft.com/devops/wp-content/uploads/sites/6/2022/05/java_logo_640.jpg"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=64087",
          "author": "April Edwards",
          "description": "Join us for episode 2 in our series for DevOps for Java Shops! In this episode Brian Benz walks us through how to deploy a Java application to Azure App Service using GitHub Actions and continuous integration.\nApril: We’re back this week with the dev ops lab and we’re continuing our series DevOps for Java shops.\nThe post Deploy a Java Application to Azure using Continuous Integration appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/deploy-a-java-application-to-azure-using-continuous-integration/",
          "publishedOn": "2022-05-20T07:51:10.000Z",
          "wordCount": 2598,
          "title": "Deploy a Java Application to Azure using Continuous Integration",
          "imageUrl": "https://devblogs.microsoft.com/devops/wp-content/uploads/sites/6/2022/05/java_logo_640.jpg"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=63937",
          "author": "Gloridel Morales",
          "description": "We have gotten a lot of feedback on this change and after internal deliberation, we are now rolling back this change ASAP.\nWe have now fully rolled back the change that caused the issue.\nThe post Updates to Azure Pipelines Runtime Variables Settings [Updated] appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/updates-to-azure-pipelines-runtime-variables-settings/",
          "publishedOn": "2022-05-19T15:00:55.000Z",
          "wordCount": 2767,
          "title": "Updates to Azure Pipelines Runtime Variables Settings [Updated]",
          "imageUrl": "https://devblogs.microsoft.com/devops/wp-content/uploads/sites/6/2018/08/vstsfeature.png"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=64084",
          "author": "April Edwards",
          "description": "Join us for episode 1 in our series for DevOps for Java Shops! In this episode Brian Benz walks us through how to deploy a Java application to Azure App Service using GitHub Actions. Brian also covers off feature flags!\nApril: Welcome to this week’s episode of the dev ops lab.\nThe post Deploy a Java application to Azure App Service using GitHub Actions appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/deploy-a-java-application-to-azure-app-service-using-github-actions/",
          "publishedOn": "2022-05-19T07:50:51.000Z",
          "wordCount": 2455,
          "title": "Deploy a Java application to Azure App Service using GitHub Actions",
          "imageUrl": "https://devblogs.microsoft.com/devops/wp-content/uploads/sites/6/2022/05/java_logo_640.jpg"
        }
      ]
    },
    {
      "title": "Azure SQL Database Devs’ Corner",
      "feedUrl": "https://devblogs.microsoft.com/azure-sql/feed/",
      "siteUrl": "https://devblogs.microsoft.com/azure-sql",
      "articles": [
        {
          "id": "https://devblogs.microsoft.com/azure-sql/?p=1347",
          "author": "Umachandar Jayachandran (UC)",
          "description": "Azure SQL Database, Azure SQL Managed Instance and SQL Server currently support JSON text processing in T-SQL batches. This functionality allows you to store and manipulate JSON documents in the database. The JSON functions – ISJSON, JSON_VALUE, JSON_QUERY, JSON_MODIFY allows you to validate,\nThe post Announcing JSON Enhancements in Azure SQL Database, Azure SQL Managed Instance and SQL Server 2022 appeared first on Azure SQL Database Devs’ Corner.",
          "link": "https://devblogs.microsoft.com/azure-sql/announcing-json-enhancements-in-azure-sql-database-azure-sql-managed-instance-and-sql-server-2022/",
          "publishedOn": "2022-06-03T23:49:53.000Z",
          "wordCount": 1680,
          "title": "Announcing JSON Enhancements in Azure SQL Database, Azure SQL Managed Instance and SQL Server 2022",
          "imageUrl": "https://devblogs.microsoft.com/azure-sql/wp-content/uploads/sites/56/2022/06/JSON-overview-image-300x169.png"
        },
        {
          "id": "https://devblogs.microsoft.com/azure-sql/?p=1294",
          "author": "Silvano Coriani",
          "description": "At Microsoft Build 2022 we’ve announced the new Azure SQL Database local development experience to the world. The combination of Visual Studio Code and Azure Data Studio extensions in addition to the new Azure SQL Database emulator for local and offline database development are aimed to significantly improve developers’\nThe post Planning new scenarios and use cases for Azure SQL Database local development experience! appeared first on Azure SQL Database Devs’ Corner.",
          "link": "https://devblogs.microsoft.com/azure-sql/planning-new-scenarios-and-use-cases-for-azure-sql-database-local-development-experience/",
          "publishedOn": "2022-05-24T15:00:56.000Z",
          "wordCount": 2147,
          "title": "Planning new scenarios and use cases for Azure SQL Database local development experience!",
          "imageUrl": null
        },
        {
          "id": "https://devblogs.microsoft.com/azure-sql/?p=1297",
          "author": "Silvano Coriani",
          "description": "The “inner loop” in software development workflows is the process of writing, building, debugging and testing code, usually on a local workstation or development environment, before sharing it with someone else. In contrast, the “outer loop” kicks off as soon as that code is checked in a source control system from where CI/CD pipelines can manage all required steps (including testing and validation) to publish code artefacts and configuration to production systems.\nThe post Welcome to the new Azure SQL Database local development experience! appeared first on Azure SQL Database Devs’ Corner.",
          "link": "https://devblogs.microsoft.com/azure-sql/welcome-to-the-new-azure-sql-database-local-development-experience/",
          "publishedOn": "2022-05-24T15:00:55.000Z",
          "wordCount": 1424,
          "title": "Welcome to the new Azure SQL Database local development experience!",
          "imageUrl": "https://devblogs.microsoft.com/azure-sql/wp-content/uploads/sites/56/2022/05/azure-sql-db-local-dev.png"
        },
        {
          "id": "https://devblogs.microsoft.com/azure-sql/?p=1275",
          "author": "Davide Mauri",
          "description": "A new, exciting capability for Azure SQL Database has been announced today at //Build: Azure SQL Database has a new built-in feature that allows native integration with external REST endpoints. This means that integration of Azure SQL Database with Azure Functions,\nThe post Announcing the “Azure SQL Database External REST Endpoints Integration” Early Adoption Program appeared first on Azure SQL Database Devs’ Corner.",
          "link": "https://devblogs.microsoft.com/azure-sql/announcing-the-azure-sql-database-external-rest-endpoints-integration-early-adoption-program/",
          "publishedOn": "2022-05-24T15:00:34.000Z",
          "wordCount": 1801,
          "title": "Announcing the “Azure SQL Database External REST Endpoints Integration” Early Adoption Program",
          "imageUrl": "https://devblogs.microsoft.com/azure-sql/wp-content/uploads/sites/56/2022/05/azure-sql-erei.jpg"
        },
        {
          "id": "https://devblogs.microsoft.com/azure-sql/?p=1310",
          "author": "Davide Mauri",
          "description": "Azure SQL Database and in general the SQL Server engine allows developers to easily get only the changed data from the last time they queried the database. More precisely, there are two features that allow us to do this and much more,\nThe post Azure SQL Database Change Stream with Debezium appeared first on Azure SQL Database Devs’ Corner.",
          "link": "https://devblogs.microsoft.com/azure-sql/azure-sql-change-stream-with-debezium/",
          "publishedOn": "2022-05-19T18:06:08.000Z",
          "wordCount": 2284,
          "title": "Azure SQL Database Change Stream with Debezium",
          "imageUrl": "https://devblogs.microsoft.com/azure-sql/wp-content/uploads/sites/56/2022/05/1_OpmqeWf_MgF1QqN7L4SOIw.jpeg"
        }
      ]
    },
    {
      "title": "Core (SQL) API - Azure Cosmos DB Blog",
      "feedUrl": "https://devblogs.microsoft.com/cosmosdb/category/core-sql-api/feed/",
      "siteUrl": "https://devblogs.microsoft.com/cosmosdb",
      "articles": [
        {
          "id": "https://devblogs.microsoft.com/cosmosdb/?p=4235",
          "author": "Ricky Diep",
          "description": "Season 3 is finally here! Explore and dive into the diverse types of architectures our customers use to build lightweight IoT & real-time telemetry applications by leveraging Azure Cosmos DB. Mustafa Branch and Mark Brown walkthrough use case diagrams, explain how data flows throughout the cloud application architecture,\nThe post Watch Now! Azure Cosmos DB Essentials Season 3 appeared first on Azure Cosmos DB Blog.",
          "link": "https://devblogs.microsoft.com/cosmosdb/watch-now-azure-cosmos-db-essentials-season-3/",
          "publishedOn": "2022-05-20T11:58:36.000Z",
          "wordCount": 1016,
          "title": "Watch Now! Azure Cosmos DB Essentials Season 3",
          "imageUrl": "https://devblogs.microsoft.com/cosmosdb/wp-content/uploads/sites/52/2022/05/Azure-Cosmos-DB-Essentials.png"
        }
      ]
    },
    {
      "title": "Microsoft Tech Community - Latest Blogs - Azure Governance and Management Blog",
      "feedUrl": "https://techcommunity.microsoft.com/plugins/custom/microsoft/o365/custom-blog-rss?tid=-2574164104208876465&board=AzureGovernanceandManagementBlog&size=100",
      "siteUrl": "https://techcommunity.microsoft.com",
      "articles": [
        {
          "id": "https://techcommunity.microsoft.com/t5/azure-governance-and-management/chaos-engineering-to-improve-application-resiliency-using-azure/ba-p/3461983",
          "author": "hputta1220",
          "description": "Digital transformation is reshaping the way we work helping us create new, innovative, and sustainable ways of working and living. This transformation led the modern application development to be Cloud native. Any application in cloud must be designed with the ability to recover from failures and continue to function without any customer downtime. This blog focuses on Chaos engineering as a methodology that helps to build resilient, well-architected applications. I discuss how Azure Chaos Studio, a latest Azure service can be used as a tool to implement Chaos engineering.\n \nWhy reliability?\nDesigning an application in cloud must meet certain architectural guidelines to operate effectively. Reliability is one of the well-architected principles of Azure that aims at hardening your applicatio…",
          "link": "https://techcommunity.microsoft.com/t5/azure-governance-and-management/chaos-engineering-to-improve-application-resiliency-using-azure/ba-p/3461983",
          "publishedOn": "2022-06-03T22:43:06.000Z",
          "wordCount": 1748,
          "title": "Chaos engineering to improve application resiliency using Azure Chaos Studio",
          "imageUrl": "https://techcommunity.microsoft.com/t5/image/serverpage/image-id/377535i3E981F536BF58F79/image-size/original?v=v2&px=-1"
        }
      ]
    },
    {
      "title": "Microsoft Open Source Blog",
      "feedUrl": "https://cloudblogs.microsoft.com/opensource/feed/",
      "siteUrl": "https://cloudblogs.microsoft.com/opensource",
      "articles": [
        {
          "id": "https://cloudblogs.microsoft.com/opensource/2022/06/06/live-demos-of-machine-learning-models-with-onnx-and-hugging-face-spaces/",
          "author": "Jacky Chen",
          "description": "Choosing which machine learning model to use, sharing a model with a colleague, and quickly trying out a model are all reasons why you may find yourself wanting to quickly run inference on a model. You can configure your environment and download Jupyter notebooks, but it would be nicer if there was a way toRead more\nThe post Live demos of machine learning models with ONNX and Hugging Face Spaces appeared first on Microsoft Open Source Blog.",
          "link": "https://cloudblogs.microsoft.com/opensource/2022/06/06/live-demos-of-machine-learning-models-with-onnx-and-hugging-face-spaces/",
          "publishedOn": "2022-06-06T15:00:00.000Z",
          "wordCount": 1828,
          "title": "Live demos of machine learning models with ONNX and Hugging Face Spaces",
          "imageUrl": "https://cloudblogs.microsoft.com/uploads/prod/sites/37/2019/04/V_1O61BK.jpg"
        },
        {
          "id": "https://cloudblogs.microsoft.com/opensource/2022/05/16/join-microsoft-at-kubecon-cloudnativecon-europe-2022/",
          "author": "Brendan Burns",
          "description": "Welcome to KubeCon Europe 2022. While I am unfortunately stuck in rainy Seattle (coldest start to May in 20 years), I'm excited that many of our cloud-native Azure folks will be able to experience sunny Valencia. It's especially exciting for KubeCon to be the first chance for parts of the Azure Kubernetes Service (AKS) teamRead more\nThe post Join Microsoft at KubeCon + CloudNativeCon Europe 2022 appeared first on Microsoft Open Source Blog.",
          "link": "https://cloudblogs.microsoft.com/opensource/2022/05/16/join-microsoft-at-kubecon-cloudnativecon-europe-2022/",
          "publishedOn": "2022-05-16T07:00:00.000Z",
          "wordCount": 1385,
          "title": "Join Microsoft at KubeCon + CloudNativeCon Europe 2022",
          "imageUrl": "https://cloudblogs.microsoft.com/uploads/prod/sites/37/2019/04/V_1O61BK.jpg"
        }
      ]
    },
    {
      "title": "Azure service updates",
      "feedUrl": "https://azurecomcdn.azureedge.net/en-us/updates/feed/?updateType=features",
      "siteUrl": "https://azure.microsoft.com/en-us/updates/",
      "articles": [
        {
          "id": "public-preview-azure-load-testing-supports-splitting-input-data-across-test-engines",
          "author": null,
          "description": "You can now configure your test to automatically split large input data evenly across the test engine instances.",
          "link": "https://azure.microsoft.com/en-us/updates/public-preview-azure-load-testing-supports-splitting-input-data-across-test-engines/",
          "publishedOn": "2022-06-08T16:00:20.000Z",
          "wordCount": 4384,
          "title": "Public preview: Azure Load Testing supports splitting input data across test engines",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "public-preview-azure-load-testing-support-for-user-specified-jmeter-properties",
          "author": null,
          "description": "Azure Load Testing preview now supports user specified JMeter properties, making load tests more configurable.",
          "link": "https://azure.microsoft.com/en-us/updates/public-preview-azure-load-testing-support-for-user-specified-jmeter-properties/",
          "publishedOn": "2022-06-08T16:00:20.000Z",
          "wordCount": 4392,
          "title": "Public preview: Azure Load Testing support for user specified JMeter properties",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "public-preview-azure-load-testing-support-for-customermanaged-keys",
          "author": null,
          "description": "You can now add another layer of security by bringing your own customer-managed keys.",
          "link": "https://azure.microsoft.com/en-us/updates/public-preview-azure-load-testing-support-for-customermanaged-keys/",
          "publishedOn": "2022-06-08T16:00:19.000Z",
          "wordCount": 4355,
          "title": "Public preview: Azure Load Testing support for customer-managed keys",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "public-preview-azure-load-testing-supports-quick-start-tests-with-web-url",
          "author": null,
          "description": "You can now create load tests quickly without prior knowledge of testing tools by entering your URL in the Azure Load Testing resource from the Azure portal.",
          "link": "https://azure.microsoft.com/en-us/updates/public-preview-azure-load-testing-supports-quick-start-tests-with-web-url/",
          "publishedOn": "2022-06-08T16:00:19.000Z",
          "wordCount": 4319,
          "title": "Public preview: Azure Load Testing supports quick start tests with web URL",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "public-preview-azure-load-testing-support-for-userassigned-managed-identities",
          "author": null,
          "description": "Use Azure AD managed identities with Azure Load Testing Preview to easily access other AAD-protected resources, like Azure Key Vault. Both system-assigned and user-assigned managed identities are now supported.",
          "link": "https://azure.microsoft.com/en-us/updates/public-preview-azure-load-testing-support-for-userassigned-managed-identities/",
          "publishedOn": "2022-06-08T16:00:18.000Z",
          "wordCount": 4359,
          "title": "Public preview: Azure Load Testing support for user-assigned managed identities",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "generally-available-azure-container-apps-support-for-custom-domains-and-tls-certificates",
          "author": null,
          "description": "You can now use custom domains and secure them with TLS certificates.",
          "link": "https://azure.microsoft.com/en-us/updates/generally-available-azure-container-apps-support-for-custom-domains-and-tls-certificates/",
          "publishedOn": "2022-06-08T16:00:17.000Z",
          "wordCount": 4338,
          "title": "Generally available: Azure Container Apps support for custom domains and TLS certificates",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "public-preview-linux-portal-editing-for-applications",
          "author": null,
          "description": "You can now edit Azure Functions running on Linux from within the Azure portal.",
          "link": "https://azure.microsoft.com/en-us/updates/public-preview-linux-portal-editing-for-applications/",
          "publishedOn": "2022-06-08T16:00:16.000Z",
          "wordCount": 4302,
          "title": "Public preview: Linux portal editing for applications",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "public-preview-mount-azure-files-and-ephemeral-storage-in-azure-container-apps",
          "author": null,
          "description": "You can now mount a file share as well as share data between multiple containers in Azure Container Apps.",
          "link": "https://azure.microsoft.com/en-us/updates/public-preview-mount-azure-files-and-ephemeral-storage-in-azure-container-apps/",
          "publishedOn": "2022-06-08T16:00:16.000Z",
          "wordCount": 4386,
          "title": "Public preview: Mount Azure Files and ephemeral storage in Azure Container Apps",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "public-preview-microsoft-graph-api-integration-with-azure-event-grid",
          "author": null,
          "description": "Use the Event Grid Microsoft Graph API integration to subscribe to events from Azure AD, Outlook, and more.",
          "link": "https://azure.microsoft.com/en-us/updates/public-preview-microsoft-graph-api-integration-with-azure-event-grid/",
          "publishedOn": "2022-06-08T16:00:15.000Z",
          "wordCount": 4321,
          "title": "Public preview: Microsoft Graph API integration with Azure Event Grid",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "static-web-apps-cli-now-available",
          "author": null,
          "description": "Deploy static web apps to the cloud using a simple CLI command.",
          "link": "https://azure.microsoft.com/en-us/updates/static-web-apps-cli-now-available/",
          "publishedOn": "2022-06-08T16:00:15.000Z",
          "wordCount": 4342,
          "title": "Static Web Apps CLI now available",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "generally-available-api-management-reusable-policy-fragments",
          "author": null,
          "description": "Organize policy components into reusable modules that can be inserted into any policy document.",
          "link": "https://azure.microsoft.com/en-us/updates/generally-available-api-management-reusable-policy-fragments/",
          "publishedOn": "2022-06-08T16:00:14.000Z",
          "wordCount": 4298,
          "title": "Generally available: API Management reusable policy fragments",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "public-preview-api-management-authorizations",
          "author": null,
          "description": "Simplify the process of managing authorization using APIs against backend services using OAuth2.",
          "link": "https://azure.microsoft.com/en-us/updates/public-preview-api-management-authorizations/",
          "publishedOn": "2022-06-08T16:00:14.000Z",
          "wordCount": 4392,
          "title": "Public preview: API Management authorizations",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "generally-available-azure-monitor-agent-available-on-latest-linux-distros",
          "author": null,
          "description": "Ubuntu 22.04, AlmaLinux, and Rocky Linux now supported via the Azure Monitor Agent.",
          "link": "https://azure.microsoft.com/en-us/updates/generally-available-azure-monitor-agent-available-on-latest-linux-distros/",
          "publishedOn": "2022-06-08T16:00:12.000Z",
          "wordCount": 4334,
          "title": "Generally available: Azure Monitor Agent available on latest Linux distros",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "public-preview-connection-monitor-support-for-virtual-machine-scale-sets",
          "author": null,
          "description": "Azure Network Watcher Connection Monitor announces support for virtual machine scale sets which enables faster performance monitoring and network troubleshooting through connectivity checks.",
          "link": "https://azure.microsoft.com/en-us/updates/public-preview-connection-monitor-support-for-virtual-machine-scale-sets/",
          "publishedOn": "2022-06-08T16:00:08.000Z",
          "wordCount": 4392,
          "title": "Public preview: Connection Monitor Support for virtual machine scale sets",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "public-preview-network-watcher-packet-capture-support-for-virtual-machine-scale-sets",
          "author": null,
          "description": "Azure Network Watcher packet capture announces support for virtual machines scale sets. This is as an out of the box, on-demand capability, enabling faster diagnostics and troubleshooting of networking issues.",
          "link": "https://azure.microsoft.com/en-us/updates/public-preview-network-watcher-packet-capture-support-for-virtual-machine-scale-sets/",
          "publishedOn": "2022-06-08T16:00:08.000Z",
          "wordCount": 4458,
          "title": "Public preview: Network Watcher packet capture support for virtual machine scale sets",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "azure-sql-generally-available-updates-for-early-june-2022",
          "author": null,
          "description": "Generally available updates made in early June 2022 for Azure SQL.",
          "link": "https://azure.microsoft.com/en-us/updates/azure-sql-generally-available-updates-for-early-june-2022/",
          "publishedOn": "2022-06-08T16:00:07.000Z",
          "wordCount": 4296,
          "title": "Azure SQL—Generally available updates for early June 2022",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "public-preview-microsoft-purview-access-policies-for-azure-sql-database",
          "author": null,
          "description": "Use Microsoft Purview to manage access to your SQL sources using access policies.",
          "link": "https://azure.microsoft.com/en-us/updates/public-preview-microsoft-purview-access-policies-for-azure-sql-database/",
          "publishedOn": "2022-06-08T16:00:06.000Z",
          "wordCount": 4366,
          "title": "Public preview: Microsoft Purview access policies for Azure SQL Database",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "public-preview-azure-cosmos-db-serverless-container-storage-limit-increase-to-1tb",
          "author": null,
          "description": "Store up to 1TB of data in Azure Cosmos DB serverless containers.",
          "link": "https://azure.microsoft.com/en-us/updates/public-preview-azure-cosmos-db-serverless-container-storage-limit-increase-to-1tb/",
          "publishedOn": "2022-06-08T16:00:06.000Z",
          "wordCount": 4348,
          "title": "Public preview: Azure Cosmos DB serverless container storage limit increase to 1TB",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "public-preview-linux-emulator-with-azure-cosmos-db-api-for-mongodb",
          "author": null,
          "description": "Develop and test locally at no cost on Linux and macOS with Azure Cosmos DB Linux emulator with API for MongoDB support.",
          "link": "https://azure.microsoft.com/en-us/updates/public-preview-linux-emulator-with-azure-cosmos-db-api-for-mongodb/",
          "publishedOn": "2022-06-08T16:00:05.000Z",
          "wordCount": 4361,
          "title": "Public preview: Linux emulator with Azure Cosmos DB API for MongoDB",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "public-preview-16mb-limit-per-document-in-api-for-mongodb",
          "author": null,
          "description": "Develop your applications with more flexibility with a new higher 16MB document limit in the API for MongoDB.",
          "link": "https://azure.microsoft.com/en-us/updates/public-preview-16mb-limit-per-document-in-api-for-mongodb/",
          "publishedOn": "2022-06-08T16:00:03.000Z",
          "wordCount": 4354,
          "title": "Public preview: 16MB limit per document in API for MongoDB",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "public-preview-azure-netapp-files-datastores-for-azure-vmware-solution-public-preview-2-2",
          "author": null,
          "description": "Optimize and scale storage for Azure VMware Solution environments.",
          "link": "https://azure.microsoft.com/en-us/updates/public-preview-azure-netapp-files-datastores-for-azure-vmware-solution-public-preview-2-2/",
          "publishedOn": "2022-06-07T20:41:29.000Z",
          "wordCount": 4495,
          "title": "Public preview: Azure NetApp Files datastores for Azure VMware Solution",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "general-availability-trusted-launch-support-for-virtual-machines-using-ephemeral-os-disks",
          "author": null,
          "description": "Trusted launch virtual machine (VM) support for VMs using Ephemeral OS disks improves the security of generation 2 VMs in Azure.",
          "link": "https://azure.microsoft.com/en-us/updates/general-availability-trusted-launch-support-for-virtual-machines-using-ephemeral-os-disks/",
          "publishedOn": "2022-06-07T17:30:03.000Z",
          "wordCount": 4369,
          "title": "General availability: Trusted launch support for virtual machines using Ephemeral OS disks",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "public-preview-expressroute-ipv6-support-for-global-reach",
          "author": null,
          "description": "IPv6 support for Global Reach expands the possibilities for customers building dual-stack, hybrid networks with Azure.",
          "link": "https://azure.microsoft.com/en-us/updates/public-preview-expressroute-ipv6-support-for-global-reach/",
          "publishedOn": "2022-06-06T16:00:01.000Z",
          "wordCount": 4318,
          "title": "Public preview: ExpressRoute IPv6 Support for Global Reach",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "ga-updates-resource-configuration-changes",
          "author": null,
          "description": "Resource configuration changes enables you to query across your subscriptions and tenants to discover changes to your resources with Azure Resource Graph.",
          "link": "https://azure.microsoft.com/en-us/updates/ga-updates-resource-configuration-changes/",
          "publishedOn": "2022-06-06T15:00:45.000Z",
          "wordCount": 4493,
          "title": "General availability: Updates for resource configuration changes",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "apdk2205update",
          "author": null,
          "description": "The Azure Percept March update includes fixes related to security.",
          "link": "https://azure.microsoft.com/en-us/updates/apdk2205update/",
          "publishedOn": "2022-06-02T19:00:39.000Z",
          "wordCount": 4332,
          "title": "Public preview: Azure Percept DK May (2205) software update",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "general-availability-conversational-language-understanding",
          "author": null,
          "description": "Conversational language understanding includes multilingual transformer-based models as the underlying model architecture and results in significant accuracy improvements over its predecessor, LUIS.",
          "link": "https://azure.microsoft.com/en-us/updates/general-availability-conversational-language-understanding/",
          "publishedOn": "2022-06-01T17:00:21.000Z",
          "wordCount": 4444,
          "title": "General availability: Conversational language understanding",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "public-preview-manage-azure-waf-policies-in-azure-firewall-manager",
          "author": null,
          "description": "Azure Firewall Manager now supports the ability to manage Azure Web Application Firewall (WAF) policies for application delivery platforms, Application Gateway, and Azure Front Door, at scale within a centralized place.",
          "link": "https://azure.microsoft.com/en-us/updates/public-preview-manage-azure-waf-policies-in-azure-firewall-manager/",
          "publishedOn": "2022-06-01T16:00:21.000Z",
          "wordCount": 4409,
          "title": "Public preview: Manage Azure Web Application Firewall policies in Azure Firewall Manager",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "general-availability-azure-bastion-ip-based-connection-connect-onpremises-resources-via-specified-ip-address",
          "author": null,
          "description": "You can now use Azure Bastion to connect to on-premises resources over ExpressRoute and Site-to-Site VPN",
          "link": "https://azure.microsoft.com/en-us/updates/general-availability-azure-bastion-ip-based-connection-connect-onpremises-resources-via-specified-ip-address/",
          "publishedOn": "2022-05-31T21:00:07.000Z",
          "wordCount": 4307,
          "title": "General availability: Azure Bastion IP based connection",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "general-availability-new-portal-experience-for-microsoft-artifact-registry",
          "author": null,
          "description": "You can now browse for Microsoft artifacts and container images on the Microsoft Artifact Registry website.",
          "link": "https://azure.microsoft.com/en-us/updates/general-availability-new-portal-experience-for-microsoft-artifact-registry/",
          "publishedOn": "2022-05-31T16:00:03.000Z",
          "wordCount": 4355,
          "title": "General availability: New portal experience for Microsoft Artifact Registry",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "general-availability-enhanced-ipv6-functionality-for-multivalue-profiles-in-azure-traffic-manager",
          "author": null,
          "description": "Azure Traffic Manager now enables you to specify minimum children property separately for IPv4 and IPv6 endpoints for MultiValue profiles.",
          "link": "https://azure.microsoft.com/en-us/updates/general-availability-enhanced-ipv6-functionality-for-multivalue-profiles-in-azure-traffic-manager/",
          "publishedOn": "2022-05-26T16:00:36.000Z",
          "wordCount": 4483,
          "title": "General availability: Enhanced IPv6 functionality for MultiValue profiles in Azure Traffic Manager",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "asaautoscalejobs",
          "author": null,
          "description": "Autoscaling allows you to define the minimum and maximum streaming units. Stream Analytics will automatically take care of dynamically optimizing the number of streaming units needed for your workload.",
          "link": "https://azure.microsoft.com/en-us/updates/asaautoscalejobs/",
          "publishedOn": "2022-05-25T05:00:12.000Z",
          "wordCount": 4329,
          "title": "Public preview: Autoscale Stream Analytics jobs",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "public-preview-azure-digital-twins-3d-scenes-studio",
          "author": null,
          "description": "3D Scenes Studio allows you to build lightweight 3D visualization with contextual data visualizations that can be consumed easily from web browsers.",
          "link": "https://azure.microsoft.com/en-us/updates/public-preview-azure-digital-twins-3d-scenes-studio/",
          "publishedOn": "2022-05-24T19:26:30.000Z",
          "wordCount": 4356,
          "title": "Public preview: Azure Digital Twins 3D Scenes Studio",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "asaqueryimprovements",
          "author": null,
          "description": "See improvements to the Stream Analytics query development experience on the Azure portal to increase productivity.",
          "link": "https://azure.microsoft.com/en-us/updates/asaqueryimprovements/",
          "publishedOn": "2022-05-24T17:00:04.000Z",
          "wordCount": 4348,
          "title": "Generally available: Stream Analytics query development improvements",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "asasizeincrease",
          "author": null,
          "description": "Maximum size of a Stream Analytics job and a cluster is increased from 192 SUs to 396 SUs.",
          "link": "https://azure.microsoft.com/en-us/updates/asasizeincrease/",
          "publishedOn": "2022-05-24T17:00:04.000Z",
          "wordCount": 4351,
          "title": "Generally available: Increased size of Stream Analytics jobs and cluster",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "asanocodeeditor",
          "author": null,
          "description": "Stream Analytics no code editor provides a rich, no code, drag and drop experience for you to build you streaming pipeline within minutes.",
          "link": "https://azure.microsoft.com/en-us/updates/asanocodeeditor/",
          "publishedOn": "2022-05-24T17:00:03.000Z",
          "wordCount": 4347,
          "title": "Public preview: Stream Analytics no code editor",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "public-preview-nginx-for-azure",
          "author": null,
          "description": "Natively integrate SaaS solution for advanced traffic management and monitoring on Azure.",
          "link": "https://azure.microsoft.com/en-us/updates/public-preview-nginx-for-azure/",
          "publishedOn": "2022-05-24T16:00:41.000Z",
          "wordCount": 4349,
          "title": "Public preview: NGINX for Azure",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "in-development-dynatrace-for-azure",
          "author": null,
          "description": "Natively integrated SaaS solution that provides deep cloud observability, advanced AIOps, and continuous runtime application security capabilities on Azure.",
          "link": "https://azure.microsoft.com/en-us/updates/in-development-dynatrace-for-azure/",
          "publishedOn": "2022-05-24T16:00:40.000Z",
          "wordCount": 4356,
          "title": "In development: Dynatrace for Azure",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "generally-available-azure-cognitive-service-for-language",
          "author": null,
          "description": "Cognitive Service for Language now includes custom named entity recognition and custom text classification.",
          "link": "https://azure.microsoft.com/en-us/updates/generally-available-azure-cognitive-service-for-language/",
          "publishedOn": "2022-05-24T16:00:35.000Z",
          "wordCount": 4350,
          "title": "Generally available: Azure Cognitive Service for Language",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "generally-available-ledger-in-azure-sql-database",
          "author": null,
          "description": "Enable proof that your database has not been tampered with and restore it back to the original value if needed by enabling ledger in Azure SQL Database.",
          "link": "https://azure.microsoft.com/en-us/updates/generally-available-ledger-in-azure-sql-database/",
          "publishedOn": "2022-05-24T16:00:35.000Z",
          "wordCount": 4348,
          "title": "Generally available: Ledger in Azure SQL Database",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "public-preview-azure-synapse-link-for-sql",
          "author": null,
          "description": "Synapse Link for SQL enables seamless near-real-time data movement from relational sources to analytical stores without the need to build ETL pipelines.",
          "link": "https://azure.microsoft.com/en-us/updates/public-preview-azure-synapse-link-for-sql/",
          "publishedOn": "2022-05-24T16:00:34.000Z",
          "wordCount": 4346,
          "title": "Public preview: Azure Synapse Link for SQL",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "public-preview-new-modern-capabilities-for-azure-sql-database",
          "author": null,
          "description": "Simplify and expedite application development and reduce time-to-market with new features for Azure SQL Database.",
          "link": "https://azure.microsoft.com/en-us/updates/public-preview-new-modern-capabilities-for-azure-sql-database/",
          "publishedOn": "2022-05-24T16:00:33.000Z",
          "wordCount": 4468,
          "title": "Public preview: New modern capabilities for Azure SQL Database",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "general-availability-azure-database-for-mysql-flexible-server-high-performance-service-tier",
          "author": null,
          "description": "Run your production workloads on the Business Critical service tier, best for high-performance transactional or analytical applications and achieve a 1.5x performance improvement over Single Server on open-source community MySQL.",
          "link": "https://azure.microsoft.com/en-us/updates/general-availability-azure-database-for-mysql-flexible-server-high-performance-service-tier/",
          "publishedOn": "2022-05-24T16:00:31.000Z",
          "wordCount": 4392,
          "title": "General availability: Azure Database for MySQL - Flexible Server Business Critical service tier",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "generally-available-azure-database-for-mysql-flexible-server-80-vcore-business-critical",
          "author": null,
          "description": "Azure Database for MySQL Flexible server is now offering 80 vCore compute for tier 1 workloads.",
          "link": "https://azure.microsoft.com/en-us/updates/generally-available-azure-database-for-mysql-flexible-server-80-vcore-business-critical/",
          "publishedOn": "2022-05-24T16:00:30.000Z",
          "wordCount": 4393,
          "title": "Generally available: Azure Database for MySQL – Flexible Server 80 vCore Business Critical",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "public-preview-azure-cosmos-db-api-for-mongodb-data-plane-rbac",
          "author": null,
          "description": "The API for MongoDB now includes the ability to create users and roles and configure fine-grained access to your database account data.",
          "link": "https://azure.microsoft.com/en-us/updates/public-preview-azure-cosmos-db-api-for-mongodb-data-plane-rbac/",
          "publishedOn": "2022-05-24T16:00:29.000Z",
          "wordCount": 4371,
          "title": "Public preview: Azure Cosmos DB API for MongoDB data plane RBAC",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "public-preview-enhanced-elasticity-features-for-azure-cosmos-db",
          "author": null,
          "description": "Elasticity features for Azure Cosmos DB help achieve the best scalability and performance, including increased serverless capacity, database traffic burst handling, partition throughput redistribution, partition merge, and hierarchical partition keys.",
          "link": "https://azure.microsoft.com/en-us/updates/public-preview-enhanced-elasticity-features-for-azure-cosmos-db/",
          "publishedOn": "2022-05-24T16:00:29.000Z",
          "wordCount": 4358,
          "title": "Public preview: Enhanced elasticity features for Azure Cosmos DB",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "general-availability-azure-cosmos-db-python-sdk-async-io-support",
          "author": null,
          "description": "Improve database performance by running I/O tasks concurrently using the Azure Cosmos DB Python SDK IO async support capability.",
          "link": "https://azure.microsoft.com/en-us/updates/general-availability-azure-cosmos-db-python-sdk-async-io-support/",
          "publishedOn": "2022-05-24T16:00:28.000Z",
          "wordCount": 4359,
          "title": "General availability: Azure Cosmos DB Python SDK async IO support",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "generally-available-azure-container-apps",
          "author": null,
          "description": "Run microservices in containers without managing infrastructure.",
          "link": "https://azure.microsoft.com/en-us/updates/generally-available-azure-container-apps/",
          "publishedOn": "2022-05-24T16:00:27.000Z",
          "wordCount": 4391,
          "title": "Generally available: Azure Container Apps",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "generally-available-azure-communication-services-sample-app-builder-and-microsoft-teams-support",
          "author": null,
          "description": "Quickly create and deploy a \"virtual visits\" experience connecting your applications with Microsoft Teams bookings.",
          "link": "https://azure.microsoft.com/en-us/updates/generally-available-azure-communication-services-sample-app-builder-and-microsoft-teams-support/",
          "publishedOn": "2022-05-24T16:00:27.000Z",
          "wordCount": 4339,
          "title": "Generally available: Azure Communication Services sample app builder and Microsoft Teams support",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "public-preview-azure-communication-services-apis-in-us-government-cloud",
          "author": null,
          "description": "Use Azure Communication Services APIs for voice, video, and messaging in US Government cloud.",
          "link": "https://azure.microsoft.com/en-us/updates/public-preview-azure-communication-services-apis-in-us-government-cloud/",
          "publishedOn": "2022-05-24T16:00:26.000Z",
          "wordCount": 4359,
          "title": "Public preview: Azure Communication Services APIs in US Government cloud",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "public-preview-azure-communication-services-email",
          "author": null,
          "description": "Add email notifications to your apps using Azure Communication Services Email.",
          "link": "https://azure.microsoft.com/en-us/updates/public-preview-azure-communication-services-email/",
          "publishedOn": "2022-05-24T16:00:25.000Z",
          "wordCount": 4318,
          "title": "Public preview: Azure Communication Services Email",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "generally-available-azure-communication-services-mobile-ui-library",
          "author": null,
          "description": "Save time with Azure Communication Services mobile UI library.",
          "link": "https://azure.microsoft.com/en-us/updates/generally-available-azure-communication-services-mobile-ui-library/",
          "publishedOn": "2022-05-24T16:00:24.000Z",
          "wordCount": 4329,
          "title": "Generally available: Azure Communication Services mobile UI library",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "public-preview-durable-functions-support-for-managed-identity-for-azure-storage",
          "author": null,
          "description": "Durable functions in Azure Functions now support using managed identity when using Azure Storage.",
          "link": "https://azure.microsoft.com/en-us/updates/public-preview-durable-functions-support-for-managed-identity-for-azure-storage/",
          "publishedOn": "2022-05-24T16:00:23.000Z",
          "wordCount": 4333,
          "title": "Public preview: Durable functions support for managed identity for Azure Storage",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "public-preview-azure-functions-net-framework-support-in-the-isolated-worker-model",
          "author": null,
          "description": "Apps using Azure Functions isolated worker model for .NET can now target .NET Framework.",
          "link": "https://azure.microsoft.com/en-us/updates/public-preview-azure-functions-net-framework-support-in-the-isolated-worker-model/",
          "publishedOn": "2022-05-24T16:00:23.000Z",
          "wordCount": 4375,
          "title": "Public preview: Azure Functions .NET Framework support in the isolated worker model",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "generally-available-dynamic-concurrency-in-azure-functions",
          "author": null,
          "description": "Azure Functions dynamic concurrency feature simplifies configuring concurrency for your function apps using Service Bus, Storage Blobs, and Storage Queue triggers.",
          "link": "https://azure.microsoft.com/en-us/updates/generally-available-dynamic-concurrency-in-azure-functions/",
          "publishedOn": "2022-05-24T16:00:22.000Z",
          "wordCount": 4333,
          "title": "Generally available: Dynamic concurrency in Azure Functions",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "public-preview-durable-functions-support-for-isolated-net-worker-process",
          "author": null,
          "description": "Build applications that need durable functions and run them in the isolated worker process within Azure Functions.",
          "link": "https://azure.microsoft.com/en-us/updates/public-preview-durable-functions-support-for-isolated-net-worker-process/",
          "publishedOn": "2022-05-24T16:00:21.000Z",
          "wordCount": 4319,
          "title": "Public preview: Durable functions support for isolated .NET worker process",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "generally-available-updated-extension-defaults-for-new-azure-functions-projects",
          "author": null,
          "description": "Extension bundles for new Azure Functions projects will now default to v3 in the client tools.",
          "link": "https://azure.microsoft.com/en-us/updates/generally-available-updated-extension-defaults-for-new-azure-functions-projects/",
          "publishedOn": "2022-05-24T16:00:21.000Z",
          "wordCount": 4319,
          "title": "Generally available: Updated extension defaults for new Azure Functions projects",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "generally-available-azure-functions-kafka-trigger-support",
          "author": null,
          "description": "You can now detect and respond to real time messages streaming into Kafka Topics.",
          "link": "https://azure.microsoft.com/en-us/updates/generally-available-azure-functions-kafka-trigger-support/",
          "publishedOn": "2022-05-24T16:00:20.000Z",
          "wordCount": 4343,
          "title": "Generally available: Azure Functions Kafka trigger support",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "public-preview-manage-your-log-analytics-tables-in-the-azure-portal",
          "author": null,
          "description": "Log Analytics Tables can now be managed from a new Tables (preview) entry of the Azure portal in Log Analytics workspaces.",
          "link": "https://azure.microsoft.com/en-us/updates/public-preview-manage-your-log-analytics-tables-in-the-azure-portal/",
          "publishedOn": "2022-05-24T16:00:19.000Z",
          "wordCount": 4390,
          "title": "Public preview: Manage your Log Analytics Tables in the Azure portal",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "general-availability-azure-stack-hci-singlenode",
          "author": null,
          "description": "Bring the benefits of hybrid to a single-node Azure Stack HCI configuration.",
          "link": "https://azure.microsoft.com/en-us/updates/general-availability-azure-stack-hci-singlenode/",
          "publishedOn": "2022-05-24T16:00:19.000Z",
          "wordCount": 4446,
          "title": "General availability: Azure Stack HCI single-node",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "public-preview-azure-monitor-application-insights-javascript-web-snippet-autoinjection-for-nodejs",
          "author": null,
          "description": "Azure Monitor application insights node.js customers can enable web monitoring with a simple configuration.",
          "link": "https://azure.microsoft.com/en-us/updates/public-preview-azure-monitor-application-insights-javascript-web-snippet-autoinjection-for-nodejs/",
          "publishedOn": "2022-05-24T16:00:18.000Z",
          "wordCount": 4375,
          "title": "Public preview: Azure Monitor application insights JavaScript web snippet auto-injection for node.js",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "public-preview-containerlogv2-schema-in-azure-monitor-container-insights",
          "author": null,
          "description": "Container insights now offers a new, lightweight schema for the container logs in ContainerLogv2.",
          "link": "https://azure.microsoft.com/en-us/updates/public-preview-containerlogv2-schema-in-azure-monitor-container-insights/",
          "publishedOn": "2022-05-24T16:00:17.000Z",
          "wordCount": 4346,
          "title": "Public preview: ContainerLogv2 schema in Azure Monitor container insights",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "public-preview-aiops-powered-intelligent-view-in-application-maps",
          "author": null,
          "description": "You can now use AIOps powered intelligent view in application map to filter out noise and find real issues faster.",
          "link": "https://azure.microsoft.com/en-us/updates/public-preview-aiops-powered-intelligent-view-in-application-maps/",
          "publishedOn": "2022-05-24T16:00:17.000Z",
          "wordCount": 4374,
          "title": "Public preview: AIOps powered intelligent view in application maps",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "generally-available-subnet-per-node-pool",
          "author": null,
          "description": "You can expand your AKS clusters across multiple subnets in the same virtual network.",
          "link": "https://azure.microsoft.com/en-us/updates/generally-available-subnet-per-node-pool/",
          "publishedOn": "2022-05-24T16:00:16.000Z",
          "wordCount": 4314,
          "title": "Generally available: Subnet per node pool",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "public-preview-windows-server-2022-host-support-in-aks",
          "author": null,
          "description": "You can now use Windows Server 2022 with AKS and benefit from its many performance-related improvements.",
          "link": "https://azure.microsoft.com/en-us/updates/public-preview-windows-server-2022-host-support-in-aks/",
          "publishedOn": "2022-05-24T16:00:15.000Z",
          "wordCount": 4342,
          "title": "Public preview: Windows Server 2022 host support in AKS",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "public-preview-draft-extension-for-azure-kubernetes-service-aks",
          "author": null,
          "description": "Use Draft through the Azure CLI, Azure Portal, and Visual Studio Code to create a Dockerfile for your application and the necessary Kubernetes manifests.",
          "link": "https://azure.microsoft.com/en-us/updates/public-preview-draft-extension-for-azure-kubernetes-service-aks/",
          "publishedOn": "2022-05-24T16:00:15.000Z",
          "wordCount": 4341,
          "title": "Public preview: Draft extension for Azure Kubernetes Service (AKS)",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "public-preview-web-application-routing-addon-for-azure-kubernetes-service-aks",
          "author": null,
          "description": "Enable an ingress controller with SSL termination to quickly and securely access your applications in AKS.",
          "link": "https://azure.microsoft.com/en-us/updates/public-preview-web-application-routing-addon-for-azure-kubernetes-service-aks/",
          "publishedOn": "2022-05-24T16:00:14.000Z",
          "wordCount": 4362,
          "title": "Public preview: Web application routing add-on for Azure Kubernetes Service (AKS)",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "public-preview-keda-addon-for-aks",
          "author": null,
          "description": "Quickly and easily deploy clusters with KEDA enabled, or enable KEDA on existing AKS clusters.",
          "link": "https://azure.microsoft.com/en-us/updates/public-preview-keda-addon-for-aks/",
          "publishedOn": "2022-05-24T16:00:13.000Z",
          "wordCount": 4337,
          "title": "Public preview: KEDA add-on for AKS",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "public-preview-azure-disk-csi-driver-v2-in-aks",
          "author": null,
          "description": "Improve scalability and reduce pod failover latency by using Azure Disk CSI driver v2 in AKS.",
          "link": "https://azure.microsoft.com/en-us/updates/public-preview-azure-disk-csi-driver-v2-in-aks/",
          "publishedOn": "2022-05-24T16:00:13.000Z",
          "wordCount": 4386,
          "title": "Public preview: Azure Disk CSI driver v2 in AKS",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "generally-available-aks-cluster-extensions",
          "author": null,
          "description": "You can now leverage a rich set of first party solutions on AKS via an Azure Resource Manager driven experience.",
          "link": "https://azure.microsoft.com/en-us/updates/generally-available-aks-cluster-extensions/",
          "publishedOn": "2022-05-24T16:00:12.000Z",
          "wordCount": 4341,
          "title": "Generally available: AKS cluster extensions",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "public-preview-arm64-agent-node-support-in-aks",
          "author": null,
          "description": "You can now create AKS clusters with mixed architecture nodes made up of Intel and ARM chips.",
          "link": "https://azure.microsoft.com/en-us/updates/public-preview-arm64-agent-node-support-in-aks/",
          "publishedOn": "2022-05-24T16:00:12.000Z",
          "wordCount": 4324,
          "title": "Public preview: ARM64 agent node support in AKS",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "generally-available-alias-minor-version-support-in-aks",
          "author": null,
          "description": "You no longer need to specify the exact patch number in your AKS setup.",
          "link": "https://azure.microsoft.com/en-us/updates/generally-available-alias-minor-version-support-in-aks/",
          "publishedOn": "2022-05-24T16:00:11.000Z",
          "wordCount": 4350,
          "title": "Generally available: Alias minor version support in AKS",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "generally-available-custom-node-configuration-on-aks",
          "author": null,
          "description": "Configure your operating system (OS) settings or the kubelet parameters to match the needs of the workloads.",
          "link": "https://azure.microsoft.com/en-us/updates/generally-available-custom-node-configuration-on-aks/",
          "publishedOn": "2022-05-24T16:00:09.000Z",
          "wordCount": 4351,
          "title": "Generally available: Custom node configuration on AKS",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "generally-available-dynamic-ip-allocation-and-enhanced-subnet-support-in-aks",
          "author": null,
          "description": "You can now deploy AKS clusters in a more IP efficient manner while still having pods with VNet IPs.",
          "link": "https://azure.microsoft.com/en-us/updates/generally-available-dynamic-ip-allocation-and-enhanced-subnet-support-in-aks/",
          "publishedOn": "2022-05-24T16:00:09.000Z",
          "wordCount": 4378,
          "title": "Generally available: Dynamic IP allocation and enhanced subnet support in AKS",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "public-preview-app-service-environment-v3-migration-feature-in-additional-regions",
          "author": null,
          "description": "Migration guidance allows you to move to App Service Environment v3 and take advantage of refreshed infrastructure, better performance, and the removal of the stamp fee found on older versions.",
          "link": "https://azure.microsoft.com/en-us/updates/public-preview-app-service-environment-v3-migration-feature-in-additional-regions/",
          "publishedOn": "2022-05-24T16:00:08.000Z",
          "wordCount": 4392,
          "title": "Public preview: App Service Environment v3 Migration Feature in additional regions",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "generally-available-app-service-enhancements-for-wordpress-on-app-service-for-linux",
          "author": null,
          "description": "Wordpress users benefit from improved performance and security.",
          "link": "https://azure.microsoft.com/en-us/updates/generally-available-app-service-enhancements-for-wordpress-on-app-service-for-linux/",
          "publishedOn": "2022-05-24T16:00:07.000Z",
          "wordCount": 4328,
          "title": "Generally available: App Service enhancements for WordPress on App Service for Linux",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "general-availability-app-service-landing-zone-accelerator",
          "author": null,
          "description": "Facilitate moving applications from on-premises to App Service using landing zone accelerator.",
          "link": "https://azure.microsoft.com/en-us/updates/general-availability-app-service-landing-zone-accelerator/",
          "publishedOn": "2022-05-24T16:00:06.000Z",
          "wordCount": 4321,
          "title": "General availability: App Service landing zone accelerator",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "public-preview-app-service-google-remote-procedure-call-support",
          "author": null,
          "description": "Host Google Remote Procedure Call (gRPC) apps on App Service.",
          "link": "https://azure.microsoft.com/en-us/updates/public-preview-app-service-google-remote-procedure-call-support/",
          "publishedOn": "2022-05-24T16:00:06.000Z",
          "wordCount": 4315,
          "title": "Public preview: App Service Google Remote Procedure Call support",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "public-preview-app-service-new-migration-capabilities",
          "author": null,
          "description": "Facilitates discovery, assessment, and migration to App Service and Azure Kubernetes Service.",
          "link": "https://azure.microsoft.com/en-us/updates/public-preview-app-service-new-migration-capabilities/",
          "publishedOn": "2022-05-24T16:00:05.000Z",
          "wordCount": 4383,
          "title": "Public preview: App Service new migration capabilities",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "iotc-dashboards-catalog",
          "author": null,
          "description": "The new dashboard catalog feature in Azure IoT Central allows for easier search, management, and navigation of dashboards.",
          "link": "https://azure.microsoft.com/en-us/updates/iotc-dashboards-catalog/",
          "publishedOn": "2022-05-19T19:00:11.000Z",
          "wordCount": 4381,
          "title": "Generally available: Easily manage your Azure IoT Central dashboards using a catalog",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "public-preview-container-storage-interface-extensible-api-for-aks",
          "author": null,
          "description": "You can now disable and enable any of the AKS supported CSI drivers using this API.",
          "link": "https://azure.microsoft.com/en-us/updates/public-preview-container-storage-interface-extensible-api-for-aks/",
          "publishedOn": "2022-05-18T06:00:51.000Z",
          "wordCount": 4303,
          "title": "Public preview: Container Storage Interface extensible API for AKS",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "public-preview-aks-private-link-service-integration",
          "author": null,
          "description": "You can now have AKS take care of creating the Private Link Service association to the Kubernetes service identified by the frontend IP configuration of an internal Azure Load Balancer.",
          "link": "https://azure.microsoft.com/en-us/updates/public-preview-aks-private-link-service-integration/",
          "publishedOn": "2022-05-18T06:00:40.000Z",
          "wordCount": 4379,
          "title": "Public preview: AKS Private Link Service integration",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "public-preview-key-management-system-integration",
          "author": null,
          "description": "You can now store secrets in BYOK encrypted etcd using Key Management System (KMS).",
          "link": "https://azure.microsoft.com/en-us/updates/public-preview-key-management-system-integration/",
          "publishedOn": "2022-05-18T06:00:33.000Z",
          "wordCount": 4378,
          "title": "Public preview: Key Management System integration",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "generally-available-open-service-mesh-extension-for-azure-arc",
          "author": null,
          "description": "You can now use a managed service mesh for Arc-enabled Kubernetes clusters.",
          "link": "https://azure.microsoft.com/en-us/updates/generally-available-open-service-mesh-extension-for-azure-arc/",
          "publishedOn": "2022-05-18T06:00:26.000Z",
          "wordCount": 4379,
          "title": "Generally available: Open Service Mesh extension for Azure Arc",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "public-preview-hostprocess-containers",
          "author": null,
          "description": "You can now package and distribute management operations and functionalities that require host access while retaining versioning and deployment methods provided by containers.",
          "link": "https://azure.microsoft.com/en-us/updates/public-preview-hostprocess-containers/",
          "publishedOn": "2022-05-18T06:00:14.000Z",
          "wordCount": 4305,
          "title": "Public preview: HostProcess Containers",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "iotc-iiot-frontdoor",
          "author": null,
          "description": "Industrial IoT starts with Azure IoT Central. Now you can leverage the expertise of Industrial IoT Connectivity Partners who are ready to connect your industrial assets in hours instead of weeks – no matter if it’s modern or legacy equipment.",
          "link": "https://azure.microsoft.com/en-us/updates/iotc-iiot-frontdoor/",
          "publishedOn": "2022-05-17T16:00:04.000Z",
          "wordCount": 4392,
          "title": "Generally available: Industrial IoT Connectivity Partners integrate with Azure IoT Central",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "cosmosdb-servicebus-asami",
          "author": null,
          "description": "Stream Analytics now supports authenticating to Azure Cosmos DB and Azure Service Bus using Managed Identities.",
          "link": "https://azure.microsoft.com/en-us/updates/cosmosdb-servicebus-asami/",
          "publishedOn": "2022-05-16T17:00:31.000Z",
          "wordCount": 4370,
          "title": "Public preview: Additional support for managed identity authentication in Azure Stream Analytics",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "public-preview-azure-dns-private-resolver-hybrid-name-resolution-and-conditional-forwarding",
          "author": null,
          "description": "Seamlessly perform conditional forwarding from on-prem to Azure Private DNS Zones and from Azure Virtual Networks to any target DNS server.",
          "link": "https://azure.microsoft.com/en-us/updates/public-preview-azure-dns-private-resolver-hybrid-name-resolution-and-conditional-forwarding/",
          "publishedOn": "2022-05-16T16:00:30.000Z",
          "wordCount": 4391,
          "title": "Public preview: Azure DNS Private Resolver – Hybrid name resolution and conditional forwarding",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "general-availability-migrate-your-azure-data-lake-storage-from-gen1-to-gen2-using-the-azure-portal-azure-updates-microsoft-az",
          "author": null,
          "description": "Migrate your data from Azure Data Lake Storage Gen1 to Gen2 to speed up your time to insights",
          "link": "https://azure.microsoft.com/en-us/updates/general-availability-migrate-your-azure-data-lake-storage-from-gen1-to-gen2-using-the-azure-portal-azure-updates-microsoft-az/",
          "publishedOn": "2022-05-12T16:00:34.000Z",
          "wordCount": 4399,
          "title": "General availability: Azure Data Lake Storage Gen1 to Gen2 using Azure Portal",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        },
        {
          "id": "read-ocr-supports-164-languages-cloud-container-2",
          "author": null,
          "description": "Computer Vision Read API for Optical Character Recognition (OCR) announced the general availability of the new model with support for 164 languages. It’s also available as a Docker container.",
          "link": "https://azure.microsoft.com/en-us/updates/read-ocr-supports-164-languages-cloud-container-2/",
          "publishedOn": "2022-05-12T15:00:33.000Z",
          "wordCount": 4387,
          "title": "Generally available: OCR supports 164 languages in the Cognitive Services Computer Vision",
          "imageUrl": "https://azurecomcdn.azureedge.net/cvt-c00c88738ef6594839378f43064be491097c45ed54edea083b9e774dcfc264f7/images/shared/social/azure-icon-250x250.png"
        }
      ]
    },
    {
      "title": "Microsoft 365 Developer Blog",
      "feedUrl": "https://devblogs.microsoft.com/microsoft365dev/feed/",
      "siteUrl": "https://devblogs.microsoft.com/microsoft365dev",
      "articles": [
        {
          "id": "https://devblogs.microsoft.com/microsoft365dev/?p=10872",
          "author": "Rabia Williams",
          "description": "The general availability of the Microsoft Teams JS SDK v2 and manifest enables developers to extend Teams apps to other Microsoft 365 host apps like Outlook and Office.com.\nThe post Microsoft Teams JS SDK v2 is now generally available appeared first on Microsoft 365 Developer Blog.",
          "link": "https://devblogs.microsoft.com/microsoft365dev/microsoft-teams-js-sdk-v2-is-now-generally-available/",
          "publishedOn": "2022-06-09T14:21:40.000Z",
          "wordCount": 1687,
          "title": "Microsoft Teams JS SDK v2 is now generally available",
          "imageUrl": "https://devblogs.microsoft.com/microsoft365dev/wp-content/uploads/sites/73/2022/06/CLO20b_VS_screen_Avery_003-min.jpg"
        },
        {
          "id": "https://devblogs.microsoft.com/microsoft365dev/?p=10332",
          "author": "Microsoft Graph team",
          "description": "We are delighted to announce that application permissions for Bookings APIs in Microsoft Graph are now available on the beta endpoint.\nThe post Application permissions for Bookings APIs in Microsoft Graph now available appeared first on Microsoft 365 Developer Blog.",
          "link": "https://devblogs.microsoft.com/microsoft365dev/application-permissions-for-bookings-apis-in-microsoft-graph-now-available/",
          "publishedOn": "2022-06-08T14:50:41.000Z",
          "wordCount": 994,
          "title": "Application permissions for Bookings APIs in Microsoft Graph now available",
          "imageUrl": "https://devblogs.microsoft.com/microsoft365dev/wp-content/uploads/sites/73/2021/11/CLO20b_Jayesh_002.jpg"
        },
        {
          "id": "https://devblogs.microsoft.com/microsoft365dev/?p=10845",
          "author": "Microsoft Graph team",
          "description": "In October 2021, we announced Licensing and pricing requirements for the following Microsoft Teams APIs in Microsoft Graph:\nchatMessage – Change Notifications API\nStarting July 5,\nThe post Upcoming billing changes for Microsoft Graph APIs for Teams messages appeared first on Microsoft 365 Developer Blog.",
          "link": "https://devblogs.microsoft.com/microsoft365dev/upcoming-billing-changes-for-microsoft-graph-apis-for-teams-messages/",
          "publishedOn": "2022-06-02T21:30:39.000Z",
          "wordCount": 817,
          "title": "Upcoming billing changes for Microsoft Graph APIs for Teams messages",
          "imageUrl": null
        },
        {
          "id": "https://devblogs.microsoft.com/microsoft365dev/?p=10830",
          "author": "Microsoft Graph team",
          "description": "We’re announcing an upcoming breaking change for developers using the Insights API (beta) that will go into effect in mid-June 2022.\nThe post Breaking changes for the Insights API (beta) appeared first on Microsoft 365 Developer Blog.",
          "link": "https://devblogs.microsoft.com/microsoft365dev/breaking-changes-for-the-insights-api-beta/",
          "publishedOn": "2022-06-02T18:31:42.000Z",
          "wordCount": 713,
          "title": "Breaking changes for the Insights API (beta)",
          "imageUrl": "https://devblogs.microsoft.com/microsoft365dev/wp-content/uploads/sites/73/2022/06/kwzWjTnDPLk-min.jpg"
        },
        {
          "id": "https://devblogs.microsoft.com/microsoft365dev/?p=10824",
          "author": "Vesa Juvonen",
          "description": "We are excited to announce first release candidate of the SharePoint Framework (SPFx) 1.15 - with updates for Viva Connections, Microsoft Teams and SharePoint Online experiences.\nThe post SharePoint Framework 1.15 Release Candidate now available with new features and updates appeared first on Microsoft 365 Developer Blog.",
          "link": "https://devblogs.microsoft.com/microsoft365dev/sharepoint-framework-1-15-release-candidate-new-features-for-viva-connections-microsoft-teams-and-sharepoint/",
          "publishedOn": "2022-06-01T17:05:26.000Z",
          "wordCount": 1355,
          "title": "SharePoint Framework 1.15 Release Candidate now available with new features and updates",
          "imageUrl": "https://devblogs.microsoft.com/microsoft365dev/wp-content/uploads/sites/73/2022/06/spfx-115-release-candidate.png"
        },
        {
          "id": "https://devblogs.microsoft.com/microsoft365dev/?p=10538",
          "author": "Dan Wahlin",
          "description": "This overview, aimed specifically at enterprise app development leaders, will help you make informed decisions about creating applications on the Microsoft Cloud.\nThe post Building applications on the Microsoft Cloud: A guide for enterprise application leaders appeared first on Microsoft 365 Developer Blog.",
          "link": "https://devblogs.microsoft.com/microsoft365dev/building-applications-on-the-microsoft-cloud-a-guide-for-enterprise-application-leaders/",
          "publishedOn": "2022-05-26T15:43:13.000Z",
          "wordCount": 870,
          "title": "Building applications on the Microsoft Cloud: A guide for enterprise application leaders",
          "imageUrl": "https://devblogs.microsoft.com/microsoft365dev/wp-content/uploads/sites/73/2022/05/CLO22_Collaboration_013.jpg"
        },
        {
          "id": "https://devblogs.microsoft.com/microsoft365dev/?p=10614",
          "author": "Tomomi Imura",
          "description": "Teams Toolkit for Visual Studio Code and the Teams Toolkit CLI are now generally available! And, for everyone building .NET web apps, Teams Toolkit for Visual Studio is available now in preview.\nThe post Microsoft Teams Toolkit for Visual Studio Code now generally available appeared first on Microsoft 365 Developer Blog.",
          "link": "https://devblogs.microsoft.com/microsoft365dev/microsoft-teams-toolkit-for-visual-studio-code-now-generally-available/",
          "publishedOn": "2022-05-26T15:00:17.000Z",
          "wordCount": 2205,
          "title": "Microsoft Teams Toolkit for Visual Studio Code now generally available",
          "imageUrl": "https://devblogs.microsoft.com/microsoft365dev/wp-content/uploads/sites/73/2022/05/cover-toolkit-GA-1000x420-1.png"
        },
        {
          "id": "https://devblogs.microsoft.com/microsoft365dev/?p=10645",
          "author": "James Lau",
          "description": "Use Microsoft Graph connectors with Microsoft Search to increase your organization’s index completeness and extend search beyond Microsoft 365 content and make them more productive. \nThe post Increase engagement and discoverability of your data with Microsoft Graph connectors appeared first on Microsoft 365 Developer Blog.",
          "link": "https://devblogs.microsoft.com/microsoft365dev/increase-engagement-and-discoverability-of-your-data-with-microsoft-graph-connectors/",
          "publishedOn": "2022-05-25T18:03:42.000Z",
          "wordCount": 1230,
          "title": "Increase engagement and discoverability of your data with Microsoft Graph connectors",
          "imageUrl": "https://devblogs.microsoft.com/microsoft365dev/wp-content/uploads/sites/73/2022/05/connectors-home-page-image.png"
        },
        {
          "id": "https://devblogs.microsoft.com/microsoft365dev/?p=10468",
          "author": "Office Add-ins team",
          "description": "Get all the new Office Add-ins announcements from Build 2022. These new features will help you create solutions to increase productivity in today’s modern hybrid environment.\nThe post What’s new for Office Add-ins at Build 2022 appeared first on Microsoft 365 Developer Blog.",
          "link": "https://devblogs.microsoft.com/microsoft365dev/whats-new-for-office-add-ins-at-build-2022/",
          "publishedOn": "2022-05-25T16:09:27.000Z",
          "wordCount": 3183,
          "title": "What’s new for Office Add-ins at Build 2022",
          "imageUrl": "https://devblogs.microsoft.com/microsoft365dev/wp-content/uploads/sites/73/2022/05/156826_MS_BUILD_THEME_5_Organic_4_1920x1080-1-min.png"
        },
        {
          "id": "https://devblogs.microsoft.com/microsoft365dev/?p=10608",
          "author": "Ben Summers",
          "description": "Welcome to Build 2022! We are excited to share all the great work our engineering teams have accomplished since last year to make Microsoft Graph better than ever.\nThe post Microsoft Graph @ Build 2022 appeared first on Microsoft 365 Developer Blog.",
          "link": "https://devblogs.microsoft.com/microsoft365dev/microsoft-graph-build-2022/",
          "publishedOn": "2022-05-25T16:04:50.000Z",
          "wordCount": 1837,
          "title": "Microsoft Graph @ Build 2022",
          "imageUrl": "https://devblogs.microsoft.com/microsoft365dev/wp-content/uploads/sites/73/2022/05/MicrosoftTeams-image-5-1.png"
        }
      ]
    }
  ],
  "cliVersion": "1.14.4"
}